PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.3 *
       3;* Date/Time created: Wed Feb  5 13:10:13 2025                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("src/main_pru0.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.3 Copyright (c) 2012-2018 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/remotefio_api/test_adc_pru_arm1/pru_firmware")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

      88;----------------------------------------------------------------------
      89
      90;***************************************************************
      91;* FNAME: main                          FR SIZE:   2           *
      92;*                                                             *
      93;* FUNCTION ENVIRONMENT                                        *
      94;*                                                             *
      95;* FUNCTION PROPERTIES                                         *
      96;*                            0 Auto,  2 SOE     *
      97;***************************************************************
      98
      99 00000000                 ||main||:
     100;* --------------------------------------------------------------------------*
     101;* r0_0  assigned to $O$C1
     102        .dwcfi  cfa_offset, 0
     103 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
     104        .dwcfi  cfa_offset, 2
     105        .dwpsn  file "src/main_pru0.c",line 50,column 2,is_stmt,isa 0
     106;----------------------------------------------------------------------
     107;  50 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
     108;  52 | // Access PRU Shared RAM using Constant Table                          
     109;  53 | // C28 defaults to 0x00000000, we need to set bits 23:8 to 0x0100 in or
     110;     | der to have it point to 0x00010000                                     
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    3

     111;----------------------------------------------------------------------
     112 00000004 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |50| CT_CFG
     113        .dwpsn  file "src/main_pru0.c",line 54,column 2,is_stmt,isa 0
     114;----------------------------------------------------------------------
     115;  54 | PRU0_CTRL.CTPPR0_bit.C28_BLK_POINTER = 0x0100;                         
     116;----------------------------------------------------------------------
     117 00000008 00008124FFFFC1          LDI32     r1, 0xffff0000        ; [ALU_PRU] |54| 
     118 00000010 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     119        .dwcfi  save_reg_to_mem, 14, -2
     120        .dwcfi  save_reg_to_mem, 15, -1
     121        .dwpsn  file "src/main_pru0.c",line 50,column 2,is_stmt,isa 0
     122 00000014 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |50| 
     123 00000018 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |50| CT_CFG
     124        .dwpsn  file "src/main_pru0.c",line 54,column 2,is_stmt,isa 0
     125 0000001c 202880240002C0          LDI32     r0, 0x00022028        ; [ALU_PRU] |54| $O$C1
     126 00000024 000000F100208E          LBBO      &r14, r0, 0, 4        ; [ALU_PRU] |54| $O$C1
     127 00000028 00000010E1EEE1          AND       r1, r14, r1           ; [ALU_PRU] |54| 
     128 0000002c 0000001F08E1E1          SET       r1, r1, 0x00000008    ; [ALU_PRU] |54| 
     129 00000030 000000E1002081          SBBO      &r1, r0, 0, 4         ; [ALU_PRU] |54| $O$C1
     130        .dwpsn  file "src/main_pru0.c",line 56,column 2,is_stmt,isa 0
     131;----------------------------------------------------------------------
     132;  56 | start();                                                               
     133;----------------------------------------------------------------------
     134$C$DW$5 .dwtag  DW_TAG_TI_branch
     135        .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     136        .dwattr $C$DW$5, DW_AT_name("start")
     137        .dwattr $C$DW$5, DW_AT_TI_call
     138
     139 00000034 000000230000C3!         JAL       r3.w2, ||start||      ; [ALU_PRU] |56| start
     140 00000038 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     141        .dwcfi  restore_reg, 14
     142        .dwcfi  restore_reg, 15
     143 0000003c 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
     144        .dwcfi  cfa_offset, 0
     145$C$DW$6 .dwtag  DW_TAG_TI_branch
     146        .dwattr $C$DW$6, DW_AT_low_pc(0x00)
     147        .dwattr $C$DW$6, DW_AT_TI_return
     148
     149 00000040 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     150        .dwattr $C$DW$4, DW_AT_TI_end_file("src/main_pru0.c")
     151        .dwattr $C$DW$4, DW_AT_TI_end_line(0x39)
     152        .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     153        .dwendentry
     154        .dwendtag $C$DW$4
     155
     156;*****************************************************************************
     157;* UNDEFINED EXTERNAL REFERENCES                                             *
     158;*****************************************************************************
     159        .global ||start||
     160
     161;******************************************************************************
     162;* TYPE INFORMATION                                                           *
     163;******************************************************************************
     164
     165$C$DW$T$19      .dwtag  DW_TAG_structure_type
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    4

     166        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     167$C$DW$7 .dwtag  DW_TAG_member
     168        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     169        .dwattr $C$DW$7, DW_AT_name("REVID")
     170        .dwattr $C$DW$7, DW_AT_TI_symbol_name("REVID")
     171        .dwattr $C$DW$7, DW_AT_bit_offset(0x00)
     172        .dwattr $C$DW$7, DW_AT_bit_size(0x20)
     173        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     174        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     175        .dwattr $C$DW$7, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335x
     176        .dwattr $C$DW$7, DW_AT_decl_line(0x2d)
     177        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     178
     179        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     180        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     181        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     182        .dwendtag $C$DW$T$19
     183
     184$C$DW$T$48      .dwtag  DW_TAG_volatile_type
     185        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
     186
     187
     188$C$DW$T$20      .dwtag  DW_TAG_structure_type
     189        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     190$C$DW$8 .dwtag  DW_TAG_member
     191        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     192        .dwattr $C$DW$8, DW_AT_name("IDLE_MODE")
     193        .dwattr $C$DW$8, DW_AT_TI_symbol_name("IDLE_MODE")
     194        .dwattr $C$DW$8, DW_AT_bit_offset(0x1e)
     195        .dwattr $C$DW$8, DW_AT_bit_size(0x02)
     196        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     197        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     198        .dwattr $C$DW$8, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335x
     199        .dwattr $C$DW$8, DW_AT_decl_line(0x37)
     200        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     201
     202$C$DW$9 .dwtag  DW_TAG_member
     203        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     204        .dwattr $C$DW$9, DW_AT_name("STANDBY_MODE")
     205        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_MODE")
     206        .dwattr $C$DW$9, DW_AT_bit_offset(0x1c)
     207        .dwattr $C$DW$9, DW_AT_bit_size(0x02)
     208        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     209        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     210        .dwattr $C$DW$9, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335x
     211        .dwattr $C$DW$9, DW_AT_decl_line(0x38)
     212        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     213
     214$C$DW$10        .dwtag  DW_TAG_member
     215        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     216        .dwattr $C$DW$10, DW_AT_name("STANDBY_INIT")
     217        .dwattr $C$DW$10, DW_AT_TI_symbol_name("STANDBY_INIT")
     218        .dwattr $C$DW$10, DW_AT_bit_offset(0x1b)
     219        .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     220        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    5

     221        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     222        .dwattr $C$DW$10, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     223        .dwattr $C$DW$10, DW_AT_decl_line(0x39)
     224        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     225
     226$C$DW$11        .dwtag  DW_TAG_member
     227        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     228        .dwattr $C$DW$11, DW_AT_name("SUB_MWAIT")
     229        .dwattr $C$DW$11, DW_AT_TI_symbol_name("SUB_MWAIT")
     230        .dwattr $C$DW$11, DW_AT_bit_offset(0x1a)
     231        .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     232        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     233        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     234        .dwattr $C$DW$11, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     235        .dwattr $C$DW$11, DW_AT_decl_line(0x3a)
     236        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     237
     238$C$DW$12        .dwtag  DW_TAG_member
     239        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     240        .dwattr $C$DW$12, DW_AT_name("rsvd6")
     241        .dwattr $C$DW$12, DW_AT_TI_symbol_name("rsvd6")
     242        .dwattr $C$DW$12, DW_AT_bit_offset(0x00)
     243        .dwattr $C$DW$12, DW_AT_bit_size(0x1a)
     244        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     245        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     246        .dwattr $C$DW$12, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     247        .dwattr $C$DW$12, DW_AT_decl_line(0x3b)
     248        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     249
     250        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     251        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     252        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     253        .dwendtag $C$DW$T$20
     254
     255$C$DW$T$50      .dwtag  DW_TAG_volatile_type
     256        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$20)
     257
     258
     259$C$DW$T$21      .dwtag  DW_TAG_structure_type
     260        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     261$C$DW$13        .dwtag  DW_TAG_member
     262        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     263        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_MODE")
     264        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     265        .dwattr $C$DW$13, DW_AT_bit_offset(0x1e)
     266        .dwattr $C$DW$13, DW_AT_bit_size(0x02)
     267        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     268        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     269        .dwattr $C$DW$13, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     270        .dwattr $C$DW$13, DW_AT_decl_line(0x45)
     271        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     272
     273$C$DW$14        .dwtag  DW_TAG_member
     274        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     275        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_CLK_MODE")
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    6

     276        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     277        .dwattr $C$DW$14, DW_AT_bit_offset(0x1d)
     278        .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     279        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     280        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     281        .dwattr $C$DW$14, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     282        .dwattr $C$DW$14, DW_AT_decl_line(0x46)
     283        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     284
     285$C$DW$15        .dwtag  DW_TAG_member
     286        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     287        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV0")
     288        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     289        .dwattr $C$DW$15, DW_AT_bit_offset(0x18)
     290        .dwattr $C$DW$15, DW_AT_bit_size(0x05)
     291        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     292        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     293        .dwattr $C$DW$15, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     294        .dwattr $C$DW$15, DW_AT_decl_line(0x47)
     295        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     296
     297$C$DW$16        .dwtag  DW_TAG_member
     298        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     299        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_DIV1")
     300        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     301        .dwattr $C$DW$16, DW_AT_bit_offset(0x13)
     302        .dwattr $C$DW$16, DW_AT_bit_size(0x05)
     303        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     304        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     305        .dwattr $C$DW$16, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     306        .dwattr $C$DW$16, DW_AT_decl_line(0x48)
     307        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     308
     309$C$DW$17        .dwtag  DW_TAG_member
     310        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     311        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_SB")
     312        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     313        .dwattr $C$DW$17, DW_AT_bit_offset(0x12)
     314        .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     315        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     316        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     317        .dwattr $C$DW$17, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     318        .dwattr $C$DW$17, DW_AT_decl_line(0x49)
     319        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     320
     321$C$DW$18        .dwtag  DW_TAG_member
     322        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     323        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_MODE")
     324        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     325        .dwattr $C$DW$18, DW_AT_bit_offset(0x11)
     326        .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     327        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     328        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     329        .dwattr $C$DW$18, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     330        .dwattr $C$DW$18, DW_AT_decl_line(0x4a)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    7

     331        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     332
     333$C$DW$19        .dwtag  DW_TAG_member
     334        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     335        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV0")
     336        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     337        .dwattr $C$DW$19, DW_AT_bit_offset(0x0c)
     338        .dwattr $C$DW$19, DW_AT_bit_size(0x05)
     339        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     341        .dwattr $C$DW$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     342        .dwattr $C$DW$19, DW_AT_decl_line(0x4b)
     343        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     344
     345$C$DW$20        .dwtag  DW_TAG_member
     346        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     347        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_DIV1")
     348        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     349        .dwattr $C$DW$20, DW_AT_bit_offset(0x07)
     350        .dwattr $C$DW$20, DW_AT_bit_size(0x05)
     351        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     352        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     353        .dwattr $C$DW$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     354        .dwattr $C$DW$20, DW_AT_decl_line(0x4c)
     355        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     356
     357$C$DW$21        .dwtag  DW_TAG_member
     358        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     359        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_SH_SEL")
     360        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     361        .dwattr $C$DW$21, DW_AT_bit_offset(0x06)
     362        .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     363        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     364        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     365        .dwattr $C$DW$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     366        .dwattr $C$DW$21, DW_AT_decl_line(0x4d)
     367        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     368
     369$C$DW$22        .dwtag  DW_TAG_member
     370        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     371        .dwattr $C$DW$22, DW_AT_name("rsvd26")
     372        .dwattr $C$DW$22, DW_AT_TI_symbol_name("rsvd26")
     373        .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     374        .dwattr $C$DW$22, DW_AT_bit_size(0x06)
     375        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     376        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     377        .dwattr $C$DW$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     378        .dwattr $C$DW$22, DW_AT_decl_line(0x4e)
     379        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     380
     381        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     382        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     383        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     384        .dwendtag $C$DW$T$21
     385
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    8

     386$C$DW$T$52      .dwtag  DW_TAG_volatile_type
     387        .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$21)
     388
     389
     390$C$DW$T$22      .dwtag  DW_TAG_structure_type
     391        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     392$C$DW$23        .dwtag  DW_TAG_member
     393        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     394        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_MODE")
     395        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     396        .dwattr $C$DW$23, DW_AT_bit_offset(0x1e)
     397        .dwattr $C$DW$23, DW_AT_bit_size(0x02)
     398        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     399        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     400        .dwattr $C$DW$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     401        .dwattr $C$DW$23, DW_AT_decl_line(0x58)
     402        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     403
     404$C$DW$24        .dwtag  DW_TAG_member
     405        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     406        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_CLK_MODE")
     407        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     408        .dwattr $C$DW$24, DW_AT_bit_offset(0x1d)
     409        .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     410        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     411        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     412        .dwattr $C$DW$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     413        .dwattr $C$DW$24, DW_AT_decl_line(0x59)
     414        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     415
     416$C$DW$25        .dwtag  DW_TAG_member
     417        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     418        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV0")
     419        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     420        .dwattr $C$DW$25, DW_AT_bit_offset(0x18)
     421        .dwattr $C$DW$25, DW_AT_bit_size(0x05)
     422        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     423        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     424        .dwattr $C$DW$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     425        .dwattr $C$DW$25, DW_AT_decl_line(0x5a)
     426        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     427
     428$C$DW$26        .dwtag  DW_TAG_member
     429        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     430        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_DIV1")
     431        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     432        .dwattr $C$DW$26, DW_AT_bit_offset(0x13)
     433        .dwattr $C$DW$26, DW_AT_bit_size(0x05)
     434        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     435        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     436        .dwattr $C$DW$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     437        .dwattr $C$DW$26, DW_AT_decl_line(0x5b)
     438        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     439
     440$C$DW$27        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    9

     441        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     442        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_SB")
     443        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     444        .dwattr $C$DW$27, DW_AT_bit_offset(0x12)
     445        .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     446        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     447        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     448        .dwattr $C$DW$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     449        .dwattr $C$DW$27, DW_AT_decl_line(0x5c)
     450        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     451
     452$C$DW$28        .dwtag  DW_TAG_member
     453        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     454        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_MODE")
     455        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     456        .dwattr $C$DW$28, DW_AT_bit_offset(0x11)
     457        .dwattr $C$DW$28, DW_AT_bit_size(0x01)
     458        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     460        .dwattr $C$DW$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     461        .dwattr $C$DW$28, DW_AT_decl_line(0x5d)
     462        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     463
     464$C$DW$29        .dwtag  DW_TAG_member
     465        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     466        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV0")
     467        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     468        .dwattr $C$DW$29, DW_AT_bit_offset(0x0c)
     469        .dwattr $C$DW$29, DW_AT_bit_size(0x05)
     470        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     471        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     472        .dwattr $C$DW$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     473        .dwattr $C$DW$29, DW_AT_decl_line(0x5e)
     474        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     475
     476$C$DW$30        .dwtag  DW_TAG_member
     477        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     478        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_DIV1")
     479        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     480        .dwattr $C$DW$30, DW_AT_bit_offset(0x07)
     481        .dwattr $C$DW$30, DW_AT_bit_size(0x05)
     482        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     484        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     485        .dwattr $C$DW$30, DW_AT_decl_line(0x5f)
     486        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     487
     488$C$DW$31        .dwtag  DW_TAG_member
     489        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     490        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_SH_SEL")
     491        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     492        .dwattr $C$DW$31, DW_AT_bit_offset(0x06)
     493        .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     494        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     495        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   10

     496        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     497        .dwattr $C$DW$31, DW_AT_decl_line(0x60)
     498        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     499
     500$C$DW$32        .dwtag  DW_TAG_member
     501        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     502        .dwattr $C$DW$32, DW_AT_name("rsvd26")
     503        .dwattr $C$DW$32, DW_AT_TI_symbol_name("rsvd26")
     504        .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     505        .dwattr $C$DW$32, DW_AT_bit_size(0x06)
     506        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     508        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     509        .dwattr $C$DW$32, DW_AT_decl_line(0x61)
     510        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     511
     512        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     513        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     514        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     515        .dwendtag $C$DW$T$22
     516
     517$C$DW$T$54      .dwtag  DW_TAG_volatile_type
     518        .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$22)
     519
     520
     521$C$DW$T$23      .dwtag  DW_TAG_structure_type
     522        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     523$C$DW$33        .dwtag  DW_TAG_member
     524        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     525        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_REQ")
     526        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     527        .dwattr $C$DW$33, DW_AT_bit_offset(0x1f)
     528        .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     529        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     530        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     531        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     532        .dwattr $C$DW$33, DW_AT_decl_line(0x6b)
     533        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     534
     535$C$DW$34        .dwtag  DW_TAG_member
     536        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     537        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_STOP_ACK")
     538        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     539        .dwattr $C$DW$34, DW_AT_bit_offset(0x1e)
     540        .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     541        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     543        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     544        .dwattr $C$DW$34, DW_AT_decl_line(0x6c)
     545        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     546
     547$C$DW$35        .dwtag  DW_TAG_member
     548        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     549        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_EN")
     550        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_EN")
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   11

     551        .dwattr $C$DW$35, DW_AT_bit_offset(0x1d)
     552        .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     553        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     555        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     556        .dwattr $C$DW$35, DW_AT_decl_line(0x6d)
     557        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     558
     559$C$DW$36        .dwtag  DW_TAG_member
     560        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     561        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_REQ")
     562        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     563        .dwattr $C$DW$36, DW_AT_bit_offset(0x1c)
     564        .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     565        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     567        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     568        .dwattr $C$DW$36, DW_AT_decl_line(0x6e)
     569        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     570
     571$C$DW$37        .dwtag  DW_TAG_member
     572        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     573        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_STOP_ACK")
     574        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     575        .dwattr $C$DW$37, DW_AT_bit_offset(0x1b)
     576        .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     577        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     578        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     579        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     580        .dwattr $C$DW$37, DW_AT_decl_line(0x6f)
     581        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     582
     583$C$DW$38        .dwtag  DW_TAG_member
     584        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     585        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_EN")
     586        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     587        .dwattr $C$DW$38, DW_AT_bit_offset(0x1a)
     588        .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     589        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     591        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     592        .dwattr $C$DW$38, DW_AT_decl_line(0x70)
     593        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     594
     595$C$DW$39        .dwtag  DW_TAG_member
     596        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     597        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_REQ")
     598        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     599        .dwattr $C$DW$39, DW_AT_bit_offset(0x19)
     600        .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     601        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     603        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     604        .dwattr $C$DW$39, DW_AT_decl_line(0x71)
     605        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   12

     606
     607$C$DW$40        .dwtag  DW_TAG_member
     608        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     609        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_STOP_ACK")
     610        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     611        .dwattr $C$DW$40, DW_AT_bit_offset(0x18)
     612        .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     613        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     614        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     615        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     616        .dwattr $C$DW$40, DW_AT_decl_line(0x72)
     617        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     618
     619$C$DW$41        .dwtag  DW_TAG_member
     620        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     621        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_EN")
     622        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_EN")
     623        .dwattr $C$DW$41, DW_AT_bit_offset(0x17)
     624        .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     625        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     626        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     627        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     628        .dwattr $C$DW$41, DW_AT_decl_line(0x73)
     629        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     630
     631$C$DW$42        .dwtag  DW_TAG_member
     632        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     633        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_REQ")
     634        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     635        .dwattr $C$DW$42, DW_AT_bit_offset(0x16)
     636        .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     637        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     639        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     640        .dwattr $C$DW$42, DW_AT_decl_line(0x74)
     641        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     642
     643$C$DW$43        .dwtag  DW_TAG_member
     644        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     645        .dwattr $C$DW$43, DW_AT_name("UART_CLK_STOP_ACK")
     646        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     647        .dwattr $C$DW$43, DW_AT_bit_offset(0x15)
     648        .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     649        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     651        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     652        .dwattr $C$DW$43, DW_AT_decl_line(0x75)
     653        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     654
     655$C$DW$44        .dwtag  DW_TAG_member
     656        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     657        .dwattr $C$DW$44, DW_AT_name("UART_CLK_EN")
     658        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_EN")
     659        .dwattr $C$DW$44, DW_AT_bit_offset(0x14)
     660        .dwattr $C$DW$44, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   13

     661        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     663        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     664        .dwattr $C$DW$44, DW_AT_decl_line(0x76)
     665        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     666
     667$C$DW$45        .dwtag  DW_TAG_member
     668        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     669        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_REQ")
     670        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     671        .dwattr $C$DW$45, DW_AT_bit_offset(0x13)
     672        .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     673        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     675        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     676        .dwattr $C$DW$45, DW_AT_decl_line(0x77)
     677        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     678
     679$C$DW$46        .dwtag  DW_TAG_member
     680        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     681        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_STOP_ACK")
     682        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     683        .dwattr $C$DW$46, DW_AT_bit_offset(0x12)
     684        .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     685        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     686        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     687        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     688        .dwattr $C$DW$46, DW_AT_decl_line(0x78)
     689        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     690
     691$C$DW$47        .dwtag  DW_TAG_member
     692        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     693        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_EN")
     694        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     695        .dwattr $C$DW$47, DW_AT_bit_offset(0x11)
     696        .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     697        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     699        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     700        .dwattr $C$DW$47, DW_AT_decl_line(0x79)
     701        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     702
     703$C$DW$48        .dwtag  DW_TAG_member
     704        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     705        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_REQ")
     706        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     707        .dwattr $C$DW$48, DW_AT_bit_offset(0x10)
     708        .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     709        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     711        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     712        .dwattr $C$DW$48, DW_AT_decl_line(0x7a)
     713        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     714
     715$C$DW$49        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   14

     716        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     717        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_STOP_ACK")
     718        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     719        .dwattr $C$DW$49, DW_AT_bit_offset(0x0f)
     720        .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     721        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     723        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     724        .dwattr $C$DW$49, DW_AT_decl_line(0x7b)
     725        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     726
     727$C$DW$50        .dwtag  DW_TAG_member
     728        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     729        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_EN")
     730        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_EN")
     731        .dwattr $C$DW$50, DW_AT_bit_offset(0x0e)
     732        .dwattr $C$DW$50, DW_AT_bit_size(0x01)
     733        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     735        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     736        .dwattr $C$DW$50, DW_AT_decl_line(0x7c)
     737        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     738
     739$C$DW$51        .dwtag  DW_TAG_member
     740        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     741        .dwattr $C$DW$51, DW_AT_name("rsvd18")
     742        .dwattr $C$DW$51, DW_AT_TI_symbol_name("rsvd18")
     743        .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     744        .dwattr $C$DW$51, DW_AT_bit_size(0x0e)
     745        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     747        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     748        .dwattr $C$DW$51, DW_AT_decl_line(0x7d)
     749        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     750
     751        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     752        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     753        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     754        .dwendtag $C$DW$T$23
     755
     756$C$DW$T$56      .dwtag  DW_TAG_volatile_type
     757        .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$23)
     758
     759
     760$C$DW$T$24      .dwtag  DW_TAG_structure_type
     761        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     762$C$DW$52        .dwtag  DW_TAG_member
     763        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     764        .dwattr $C$DW$52, DW_AT_name("PRU0_IMEM_PE_RAW")
     765        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     766        .dwattr $C$DW$52, DW_AT_bit_offset(0x1c)
     767        .dwattr $C$DW$52, DW_AT_bit_size(0x04)
     768        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     770        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   15

     771        .dwattr $C$DW$52, DW_AT_decl_line(0x87)
     772        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     773
     774$C$DW$53        .dwtag  DW_TAG_member
     775        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     776        .dwattr $C$DW$53, DW_AT_name("PRU0_DMEM_PE_RAW")
     777        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     778        .dwattr $C$DW$53, DW_AT_bit_offset(0x18)
     779        .dwattr $C$DW$53, DW_AT_bit_size(0x04)
     780        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     781        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     782        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     783        .dwattr $C$DW$53, DW_AT_decl_line(0x88)
     784        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     785
     786$C$DW$54        .dwtag  DW_TAG_member
     787        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     788        .dwattr $C$DW$54, DW_AT_name("PRU1_IMEM_PE_RAW")
     789        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     790        .dwattr $C$DW$54, DW_AT_bit_offset(0x14)
     791        .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     792        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     793        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     794        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     795        .dwattr $C$DW$54, DW_AT_decl_line(0x89)
     796        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     797
     798$C$DW$55        .dwtag  DW_TAG_member
     799        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     800        .dwattr $C$DW$55, DW_AT_name("PRU1_DMEM_PE_RAW")
     801        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     802        .dwattr $C$DW$55, DW_AT_bit_offset(0x10)
     803        .dwattr $C$DW$55, DW_AT_bit_size(0x04)
     804        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     806        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     807        .dwattr $C$DW$55, DW_AT_decl_line(0x8a)
     808        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     809
     810$C$DW$56        .dwtag  DW_TAG_member
     811        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     812        .dwattr $C$DW$56, DW_AT_name("RAM_PE_RAW")
     813        .dwattr $C$DW$56, DW_AT_TI_symbol_name("RAM_PE_RAW")
     814        .dwattr $C$DW$56, DW_AT_bit_offset(0x0c)
     815        .dwattr $C$DW$56, DW_AT_bit_size(0x04)
     816        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     818        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     819        .dwattr $C$DW$56, DW_AT_decl_line(0x8b)
     820        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     821
     822$C$DW$57        .dwtag  DW_TAG_member
     823        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     824        .dwattr $C$DW$57, DW_AT_name("rsvd20")
     825        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd20")
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   16

     826        .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
     827        .dwattr $C$DW$57, DW_AT_bit_size(0x0c)
     828        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     830        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     831        .dwattr $C$DW$57, DW_AT_decl_line(0x8c)
     832        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     833
     834        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     835        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     836        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     837        .dwendtag $C$DW$T$24
     838
     839$C$DW$T$58      .dwtag  DW_TAG_volatile_type
     840        .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$24)
     841
     842
     843$C$DW$T$25      .dwtag  DW_TAG_structure_type
     844        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     845$C$DW$58        .dwtag  DW_TAG_member
     846        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     847        .dwattr $C$DW$58, DW_AT_name("PRU0_IMEM_PE")
     848        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     849        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c)
     850        .dwattr $C$DW$58, DW_AT_bit_size(0x04)
     851        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     853        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     854        .dwattr $C$DW$58, DW_AT_decl_line(0x96)
     855        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     856
     857$C$DW$59        .dwtag  DW_TAG_member
     858        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     859        .dwattr $C$DW$59, DW_AT_name("PRU0_DMEM_PE")
     860        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     861        .dwattr $C$DW$59, DW_AT_bit_offset(0x18)
     862        .dwattr $C$DW$59, DW_AT_bit_size(0x04)
     863        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     865        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     866        .dwattr $C$DW$59, DW_AT_decl_line(0x97)
     867        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     868
     869$C$DW$60        .dwtag  DW_TAG_member
     870        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     871        .dwattr $C$DW$60, DW_AT_name("PRU1_IMEM_PE")
     872        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     873        .dwattr $C$DW$60, DW_AT_bit_offset(0x14)
     874        .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     875        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     877        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     878        .dwattr $C$DW$60, DW_AT_decl_line(0x98)
     879        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     880
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   17

     881$C$DW$61        .dwtag  DW_TAG_member
     882        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     883        .dwattr $C$DW$61, DW_AT_name("PRU1_DMEM_PE")
     884        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     885        .dwattr $C$DW$61, DW_AT_bit_offset(0x10)
     886        .dwattr $C$DW$61, DW_AT_bit_size(0x04)
     887        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     889        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     890        .dwattr $C$DW$61, DW_AT_decl_line(0x99)
     891        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     892
     893$C$DW$62        .dwtag  DW_TAG_member
     894        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     895        .dwattr $C$DW$62, DW_AT_name("RAM_PE")
     896        .dwattr $C$DW$62, DW_AT_TI_symbol_name("RAM_PE")
     897        .dwattr $C$DW$62, DW_AT_bit_offset(0x0c)
     898        .dwattr $C$DW$62, DW_AT_bit_size(0x04)
     899        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     901        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     902        .dwattr $C$DW$62, DW_AT_decl_line(0x9a)
     903        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     904
     905$C$DW$63        .dwtag  DW_TAG_member
     906        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     907        .dwattr $C$DW$63, DW_AT_name("rsvd20")
     908        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd20")
     909        .dwattr $C$DW$63, DW_AT_bit_offset(0x00)
     910        .dwattr $C$DW$63, DW_AT_bit_size(0x0c)
     911        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     913        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     914        .dwattr $C$DW$63, DW_AT_decl_line(0x9b)
     915        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     916
     917        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     918        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     919        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     920        .dwendtag $C$DW$T$25
     921
     922$C$DW$T$60      .dwtag  DW_TAG_volatile_type
     923        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$25)
     924
     925
     926$C$DW$T$26      .dwtag  DW_TAG_structure_type
     927        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     928$C$DW$64        .dwtag  DW_TAG_member
     929        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     930        .dwattr $C$DW$64, DW_AT_name("PRU0_IMEM_PE_SET")
     931        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     932        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c)
     933        .dwattr $C$DW$64, DW_AT_bit_size(0x04)
     934        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   18

     936        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     937        .dwattr $C$DW$64, DW_AT_decl_line(0xa4)
     938        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     939
     940$C$DW$65        .dwtag  DW_TAG_member
     941        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     942        .dwattr $C$DW$65, DW_AT_name("PRU0_DMEM_PE_SET")
     943        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     944        .dwattr $C$DW$65, DW_AT_bit_offset(0x18)
     945        .dwattr $C$DW$65, DW_AT_bit_size(0x04)
     946        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     948        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     949        .dwattr $C$DW$65, DW_AT_decl_line(0xa5)
     950        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     951
     952$C$DW$66        .dwtag  DW_TAG_member
     953        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     954        .dwattr $C$DW$66, DW_AT_name("PRU1_IMEM_PE_SET")
     955        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     956        .dwattr $C$DW$66, DW_AT_bit_offset(0x14)
     957        .dwattr $C$DW$66, DW_AT_bit_size(0x04)
     958        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     960        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     961        .dwattr $C$DW$66, DW_AT_decl_line(0xa6)
     962        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     963
     964$C$DW$67        .dwtag  DW_TAG_member
     965        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     966        .dwattr $C$DW$67, DW_AT_name("PRU1_DMEM_PE_SET")
     967        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     968        .dwattr $C$DW$67, DW_AT_bit_offset(0x10)
     969        .dwattr $C$DW$67, DW_AT_bit_size(0x04)
     970        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     972        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     973        .dwattr $C$DW$67, DW_AT_decl_line(0xa7)
     974        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     975
     976$C$DW$68        .dwtag  DW_TAG_member
     977        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     978        .dwattr $C$DW$68, DW_AT_name("RAM_PE_SET")
     979        .dwattr $C$DW$68, DW_AT_TI_symbol_name("RAM_PE_SET")
     980        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c)
     981        .dwattr $C$DW$68, DW_AT_bit_size(0x04)
     982        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     984        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     985        .dwattr $C$DW$68, DW_AT_decl_line(0xa8)
     986        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     987
     988$C$DW$69        .dwtag  DW_TAG_member
     989        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     990        .dwattr $C$DW$69, DW_AT_name("rsvd20")
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   19

     991        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd20")
     992        .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
     993        .dwattr $C$DW$69, DW_AT_bit_size(0x0c)
     994        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     996        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     997        .dwattr $C$DW$69, DW_AT_decl_line(0xa9)
     998        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     999
    1000        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1001        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1002        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1003        .dwendtag $C$DW$T$26
    1004
    1005$C$DW$T$62      .dwtag  DW_TAG_volatile_type
    1006        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$26)
    1007
    1008
    1009$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1010        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1011$C$DW$70        .dwtag  DW_TAG_member
    1012        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1013        .dwattr $C$DW$70, DW_AT_name("PRU0_IMEM_PE_CLR")
    1014        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1015        .dwattr $C$DW$70, DW_AT_bit_offset(0x1c)
    1016        .dwattr $C$DW$70, DW_AT_bit_size(0x04)
    1017        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1019        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1020        .dwattr $C$DW$70, DW_AT_decl_line(0xb3)
    1021        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1022
    1023$C$DW$71        .dwtag  DW_TAG_member
    1024        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1025        .dwattr $C$DW$71, DW_AT_name("PRU0_DMEM_PE_CLR")
    1026        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1027        .dwattr $C$DW$71, DW_AT_bit_offset(0x18)
    1028        .dwattr $C$DW$71, DW_AT_bit_size(0x04)
    1029        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1031        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1032        .dwattr $C$DW$71, DW_AT_decl_line(0xb4)
    1033        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1034
    1035$C$DW$72        .dwtag  DW_TAG_member
    1036        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1037        .dwattr $C$DW$72, DW_AT_name("PRU1_IMEM_PE_CLR")
    1038        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1039        .dwattr $C$DW$72, DW_AT_bit_offset(0x14)
    1040        .dwattr $C$DW$72, DW_AT_bit_size(0x04)
    1041        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1043        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1044        .dwattr $C$DW$72, DW_AT_decl_line(0xb5)
    1045        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   20

    1046
    1047$C$DW$73        .dwtag  DW_TAG_member
    1048        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1049        .dwattr $C$DW$73, DW_AT_name("PRU1_DMEM_PE_CLR")
    1050        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1051        .dwattr $C$DW$73, DW_AT_bit_offset(0x10)
    1052        .dwattr $C$DW$73, DW_AT_bit_size(0x04)
    1053        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1055        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1056        .dwattr $C$DW$73, DW_AT_decl_line(0xb6)
    1057        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1058
    1059$C$DW$74        .dwtag  DW_TAG_member
    1060        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1061        .dwattr $C$DW$74, DW_AT_name("rsvd16")
    1062        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd16")
    1063        .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1064        .dwattr $C$DW$74, DW_AT_bit_size(0x10)
    1065        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1067        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1068        .dwattr $C$DW$74, DW_AT_decl_line(0xb7)
    1069        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1070
    1071        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1072        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1073        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1074        .dwendtag $C$DW$T$27
    1075
    1076$C$DW$T$64      .dwtag  DW_TAG_volatile_type
    1077        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$27)
    1078
    1079
    1080$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1081        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1082$C$DW$75        .dwtag  DW_TAG_member
    1083        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1084        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU0")
    1085        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU0")
    1086        .dwattr $C$DW$75, DW_AT_bit_offset(0x1f)
    1087        .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1088        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1090        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1091        .dwattr $C$DW$75, DW_AT_decl_line(0xc4)
    1092        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1093
    1094$C$DW$76        .dwtag  DW_TAG_member
    1095        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1096        .dwattr $C$DW$76, DW_AT_name("PMAO_PRU1")
    1097        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PMAO_PRU1")
    1098        .dwattr $C$DW$76, DW_AT_bit_offset(0x1e)
    1099        .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1100        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   21

    1101        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1102        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1103        .dwattr $C$DW$76, DW_AT_decl_line(0xc5)
    1104        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1105
    1106$C$DW$77        .dwtag  DW_TAG_member
    1107        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1108        .dwattr $C$DW$77, DW_AT_name("rsvd2")
    1109        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd2")
    1110        .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1111        .dwattr $C$DW$77, DW_AT_bit_size(0x1e)
    1112        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1114        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1115        .dwattr $C$DW$77, DW_AT_decl_line(0xc6)
    1116        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1117
    1118        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1119        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1120        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1121        .dwendtag $C$DW$T$28
    1122
    1123$C$DW$T$66      .dwtag  DW_TAG_volatile_type
    1124        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$28)
    1125
    1126
    1127$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1128        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1129$C$DW$78        .dwtag  DW_TAG_member
    1130        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1131        .dwattr $C$DW$78, DW_AT_name("OCP_EN")
    1132        .dwattr $C$DW$78, DW_AT_TI_symbol_name("OCP_EN")
    1133        .dwattr $C$DW$78, DW_AT_bit_offset(0x1f)
    1134        .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1135        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1137        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1138        .dwattr $C$DW$78, DW_AT_decl_line(0xd3)
    1139        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1140
    1141$C$DW$79        .dwtag  DW_TAG_member
    1142        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1143        .dwattr $C$DW$79, DW_AT_name("rsvd1")
    1144        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd1")
    1145        .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1146        .dwattr $C$DW$79, DW_AT_bit_size(0x1f)
    1147        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1149        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1150        .dwattr $C$DW$79, DW_AT_decl_line(0xd4)
    1151        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1152
    1153        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1154        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1155        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   22

    1156        .dwendtag $C$DW$T$29
    1157
    1158$C$DW$T$68      .dwtag  DW_TAG_volatile_type
    1159        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$29)
    1160
    1161
    1162$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1163        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1164$C$DW$80        .dwtag  DW_TAG_member
    1165        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1166        .dwattr $C$DW$80, DW_AT_name("PRU1_PAD_HP_EN")
    1167        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1168        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f)
    1169        .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1170        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1172        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1173        .dwattr $C$DW$80, DW_AT_decl_line(0xde)
    1174        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1175
    1176$C$DW$81        .dwtag  DW_TAG_member
    1177        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1178        .dwattr $C$DW$81, DW_AT_name("XFR_SHIFT_EN")
    1179        .dwattr $C$DW$81, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1180        .dwattr $C$DW$81, DW_AT_bit_offset(0x1e)
    1181        .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1182        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1184        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1185        .dwattr $C$DW$81, DW_AT_decl_line(0xdf)
    1186        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1187
    1188$C$DW$82        .dwtag  DW_TAG_member
    1189        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1190        .dwattr $C$DW$82, DW_AT_name("rsvd2")
    1191        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd2")
    1192        .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1193        .dwattr $C$DW$82, DW_AT_bit_size(0x1e)
    1194        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1196        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1197        .dwattr $C$DW$82, DW_AT_decl_line(0xe0)
    1198        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1199
    1200        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1201        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1202        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1203        .dwendtag $C$DW$T$30
    1204
    1205$C$DW$T$70      .dwtag  DW_TAG_volatile_type
    1206        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$30)
    1207
    1208
    1209$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1210        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   23

    1211$C$DW$83        .dwtag  DW_TAG_member
    1212        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1213        .dwattr $C$DW$83, DW_AT_name("PIN_MUX_SEL")
    1214        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1215        .dwattr $C$DW$83, DW_AT_bit_offset(0x18)
    1216        .dwattr $C$DW$83, DW_AT_bit_size(0x08)
    1217        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1219        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1220        .dwattr $C$DW$83, DW_AT_decl_line(0xec)
    1221        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1222
    1223$C$DW$84        .dwtag  DW_TAG_member
    1224        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1225        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1226        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1227        .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
    1228        .dwattr $C$DW$84, DW_AT_bit_size(0x18)
    1229        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1230        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1231        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1232        .dwattr $C$DW$84, DW_AT_decl_line(0xed)
    1233        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1234
    1235        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1236        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1237        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1238        .dwendtag $C$DW$T$31
    1239
    1240$C$DW$T$72      .dwtag  DW_TAG_volatile_type
    1241        .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$31)
    1242
    1243
    1244$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1245        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1246$C$DW$85        .dwtag  DW_TAG_member
    1247        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$49)
    1248        .dwattr $C$DW$85, DW_AT_name("$P$T0")
    1249        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T0")
    1250        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1252        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1253        .dwattr $C$DW$85, DW_AT_decl_line(0x29)
    1254        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1255
    1256$C$DW$86        .dwtag  DW_TAG_member
    1257        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$51)
    1258        .dwattr $C$DW$86, DW_AT_name("$P$T1")
    1259        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T1")
    1260        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1261        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1262        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1263        .dwattr $C$DW$86, DW_AT_decl_line(0x33)
    1264        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1265
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   24

    1266$C$DW$87        .dwtag  DW_TAG_member
    1267        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$53)
    1268        .dwattr $C$DW$87, DW_AT_name("$P$T2")
    1269        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T2")
    1270        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1271        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1272        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1273        .dwattr $C$DW$87, DW_AT_decl_line(0x41)
    1274        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1275
    1276$C$DW$88        .dwtag  DW_TAG_member
    1277        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$55)
    1278        .dwattr $C$DW$88, DW_AT_name("$P$T3")
    1279        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T3")
    1280        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1281        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1282        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1283        .dwattr $C$DW$88, DW_AT_decl_line(0x54)
    1284        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1285
    1286$C$DW$89        .dwtag  DW_TAG_member
    1287        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$57)
    1288        .dwattr $C$DW$89, DW_AT_name("$P$T4")
    1289        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T4")
    1290        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1291        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1292        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1293        .dwattr $C$DW$89, DW_AT_decl_line(0x67)
    1294        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1295
    1296$C$DW$90        .dwtag  DW_TAG_member
    1297        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$59)
    1298        .dwattr $C$DW$90, DW_AT_name("$P$T5")
    1299        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T5")
    1300        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1301        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1302        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1303        .dwattr $C$DW$90, DW_AT_decl_line(0x83)
    1304        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1305
    1306$C$DW$91        .dwtag  DW_TAG_member
    1307        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$61)
    1308        .dwattr $C$DW$91, DW_AT_name("$P$T6")
    1309        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T6")
    1310        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1311        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1312        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1313        .dwattr $C$DW$91, DW_AT_decl_line(0x92)
    1314        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1315
    1316$C$DW$92        .dwtag  DW_TAG_member
    1317        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$63)
    1318        .dwattr $C$DW$92, DW_AT_name("$P$T7")
    1319        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T7")
    1320        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   25

    1321        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1322        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1323        .dwattr $C$DW$92, DW_AT_decl_line(0xa0)
    1324        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1325
    1326$C$DW$93        .dwtag  DW_TAG_member
    1327        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$65)
    1328        .dwattr $C$DW$93, DW_AT_name("$P$T8")
    1329        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T8")
    1330        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1331        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1332        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1333        .dwattr $C$DW$93, DW_AT_decl_line(0xaf)
    1334        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1335
    1336$C$DW$94        .dwtag  DW_TAG_member
    1337        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
    1338        .dwattr $C$DW$94, DW_AT_name("rsvd24")
    1339        .dwattr $C$DW$94, DW_AT_TI_symbol_name("rsvd24")
    1340        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1341        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1342        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1343        .dwattr $C$DW$94, DW_AT_decl_line(0xbc)
    1344        .dwattr $C$DW$94, DW_AT_decl_column(0x0b)
    1345
    1346$C$DW$95        .dwtag  DW_TAG_member
    1347        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$67)
    1348        .dwattr $C$DW$95, DW_AT_name("$P$T9")
    1349        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T9")
    1350        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1351        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1352        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1353        .dwattr $C$DW$95, DW_AT_decl_line(0xc0)
    1354        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1355
    1356$C$DW$96        .dwtag  DW_TAG_member
    1357        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
    1358        .dwattr $C$DW$96, DW_AT_name("rsvd2c")
    1359        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd2c")
    1360        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1361        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1362        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1363        .dwattr $C$DW$96, DW_AT_decl_line(0xcb)
    1364        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1365
    1366$C$DW$97        .dwtag  DW_TAG_member
    1367        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$69)
    1368        .dwattr $C$DW$97, DW_AT_name("$P$T10")
    1369        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T10")
    1370        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1371        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1372        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1373        .dwattr $C$DW$97, DW_AT_decl_line(0xcf)
    1374        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1375
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   26

    1376$C$DW$98        .dwtag  DW_TAG_member
    1377        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$71)
    1378        .dwattr $C$DW$98, DW_AT_name("$P$T11")
    1379        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T11")
    1380        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1381        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1382        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1383        .dwattr $C$DW$98, DW_AT_decl_line(0xda)
    1384        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1385
    1386$C$DW$99        .dwtag  DW_TAG_member
    1387        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1388        .dwattr $C$DW$99, DW_AT_name("rsvd38")
    1389        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd38")
    1390        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1391        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1392        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1393        .dwattr $C$DW$99, DW_AT_decl_line(0xe5)
    1394        .dwattr $C$DW$99, DW_AT_decl_column(0x0b)
    1395
    1396$C$DW$100       .dwtag  DW_TAG_member
    1397        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$73)
    1398        .dwattr $C$DW$100, DW_AT_name("$P$T12")
    1399        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T12")
    1400        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1401        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1402        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1403        .dwattr $C$DW$100, DW_AT_decl_line(0xe8)
    1404        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1405
    1406        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1407        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1408        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1409        .dwendtag $C$DW$T$35
    1410
    1411$C$DW$T$97      .dwtag  DW_TAG_typedef
    1412        .dwattr $C$DW$T$97, DW_AT_name("pruCfg")
    1413        .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$35)
    1414        .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1415        .dwattr $C$DW$T$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1416        .dwattr $C$DW$T$97, DW_AT_decl_line(0xf0)
    1417        .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    1418
    1419$C$DW$T$98      .dwtag  DW_TAG_volatile_type
    1420        .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    1421
    1422
    1423$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1424        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1425$C$DW$101       .dwtag  DW_TAG_member
    1426        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1427        .dwattr $C$DW$101, DW_AT_name("C28_BLK_POINTER")
    1428        .dwattr $C$DW$101, DW_AT_TI_symbol_name("C28_BLK_POINTER")
    1429        .dwattr $C$DW$101, DW_AT_bit_offset(0x10)
    1430        .dwattr $C$DW$101, DW_AT_bit_size(0x10)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   27

    1431        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1433        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1434        .dwattr $C$DW$101, DW_AT_decl_line(0x85)
    1435        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1436
    1437$C$DW$102       .dwtag  DW_TAG_member
    1438        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1439        .dwattr $C$DW$102, DW_AT_name("C29_BLK_POINTER")
    1440        .dwattr $C$DW$102, DW_AT_TI_symbol_name("C29_BLK_POINTER")
    1441        .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1442        .dwattr $C$DW$102, DW_AT_bit_size(0x10)
    1443        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1445        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1446        .dwattr $C$DW$102, DW_AT_decl_line(0x86)
    1447        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1448
    1449        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1450        .dwattr $C$DW$T$36, DW_AT_decl_line(0x84)
    1451        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1452        .dwendtag $C$DW$T$36
    1453
    1454$C$DW$T$74      .dwtag  DW_TAG_volatile_type
    1455        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    1456
    1457
    1458$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1459        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1460$C$DW$103       .dwtag  DW_TAG_member
    1461        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1462        .dwattr $C$DW$103, DW_AT_name("SOFT_RST_N")
    1463        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SOFT_RST_N")
    1464        .dwattr $C$DW$103, DW_AT_bit_offset(0x1f)
    1465        .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1466        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1468        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1469        .dwattr $C$DW$103, DW_AT_decl_line(0x2d)
    1470        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1471
    1472$C$DW$104       .dwtag  DW_TAG_member
    1473        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1474        .dwattr $C$DW$104, DW_AT_name("EN")
    1475        .dwattr $C$DW$104, DW_AT_TI_symbol_name("EN")
    1476        .dwattr $C$DW$104, DW_AT_bit_offset(0x1e)
    1477        .dwattr $C$DW$104, DW_AT_bit_size(0x01)
    1478        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1480        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1481        .dwattr $C$DW$104, DW_AT_decl_line(0x2e)
    1482        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1483
    1484$C$DW$105       .dwtag  DW_TAG_member
    1485        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   28

    1486        .dwattr $C$DW$105, DW_AT_name("SLEEPING")
    1487        .dwattr $C$DW$105, DW_AT_TI_symbol_name("SLEEPING")
    1488        .dwattr $C$DW$105, DW_AT_bit_offset(0x1d)
    1489        .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1490        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1492        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1493        .dwattr $C$DW$105, DW_AT_decl_line(0x2f)
    1494        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1495
    1496$C$DW$106       .dwtag  DW_TAG_member
    1497        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1498        .dwattr $C$DW$106, DW_AT_name("CTR_EN")
    1499        .dwattr $C$DW$106, DW_AT_TI_symbol_name("CTR_EN")
    1500        .dwattr $C$DW$106, DW_AT_bit_offset(0x1c)
    1501        .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1502        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1504        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1505        .dwattr $C$DW$106, DW_AT_decl_line(0x30)
    1506        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1507
    1508$C$DW$107       .dwtag  DW_TAG_member
    1509        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1510        .dwattr $C$DW$107, DW_AT_name("rsvd4")
    1511        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd4")
    1512        .dwattr $C$DW$107, DW_AT_bit_offset(0x18)
    1513        .dwattr $C$DW$107, DW_AT_bit_size(0x04)
    1514        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1515        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1516        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1517        .dwattr $C$DW$107, DW_AT_decl_line(0x31)
    1518        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1519
    1520$C$DW$108       .dwtag  DW_TAG_member
    1521        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1522        .dwattr $C$DW$108, DW_AT_name("SINGLE_STEP")
    1523        .dwattr $C$DW$108, DW_AT_TI_symbol_name("SINGLE_STEP")
    1524        .dwattr $C$DW$108, DW_AT_bit_offset(0x17)
    1525        .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1526        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1528        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1529        .dwattr $C$DW$108, DW_AT_decl_line(0x32)
    1530        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1531
    1532$C$DW$109       .dwtag  DW_TAG_member
    1533        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1534        .dwattr $C$DW$109, DW_AT_name("rsvd9")
    1535        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd9")
    1536        .dwattr $C$DW$109, DW_AT_bit_offset(0x11)
    1537        .dwattr $C$DW$109, DW_AT_bit_size(0x06)
    1538        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1540        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   29

    1541        .dwattr $C$DW$109, DW_AT_decl_line(0x33)
    1542        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1543
    1544$C$DW$110       .dwtag  DW_TAG_member
    1545        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1546        .dwattr $C$DW$110, DW_AT_name("RUNSTATE")
    1547        .dwattr $C$DW$110, DW_AT_TI_symbol_name("RUNSTATE")
    1548        .dwattr $C$DW$110, DW_AT_bit_offset(0x10)
    1549        .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    1550        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1551        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1552        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1553        .dwattr $C$DW$110, DW_AT_decl_line(0x34)
    1554        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1555
    1556$C$DW$111       .dwtag  DW_TAG_member
    1557        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1558        .dwattr $C$DW$111, DW_AT_name("PCTR_RST_VAL")
    1559        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PCTR_RST_VAL")
    1560        .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1561        .dwattr $C$DW$111, DW_AT_bit_size(0x10)
    1562        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1564        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1565        .dwattr $C$DW$111, DW_AT_decl_line(0x35)
    1566        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1567
    1568        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1569        .dwattr $C$DW$T$37, DW_AT_decl_line(0x2c)
    1570        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1571        .dwendtag $C$DW$T$37
    1572
    1573$C$DW$T$76      .dwtag  DW_TAG_volatile_type
    1574        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$37)
    1575
    1576
    1577$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1578        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1579$C$DW$112       .dwtag  DW_TAG_member
    1580        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1581        .dwattr $C$DW$112, DW_AT_name("PCTR")
    1582        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PCTR")
    1583        .dwattr $C$DW$112, DW_AT_bit_offset(0x10)
    1584        .dwattr $C$DW$112, DW_AT_bit_size(0x10)
    1585        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1587        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1588        .dwattr $C$DW$112, DW_AT_decl_line(0x3f)
    1589        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1590
    1591$C$DW$113       .dwtag  DW_TAG_member
    1592        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1593        .dwattr $C$DW$113, DW_AT_name("rsvd16")
    1594        .dwattr $C$DW$113, DW_AT_TI_symbol_name("rsvd16")
    1595        .dwattr $C$DW$113, DW_AT_bit_offset(0x00)
PRU Assembler Unix v2.3.3 Wed Feb  5 13:10:14 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   30

    1596        .dwattr $C$DW$113, DW_AT_bit_size(0x10)
    1597        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1598        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1599        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1600        .dwattr $C$DW$113, DW_AT_decl_line(0x40)
    1601        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1602
    1603        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1604        .dwattr $C$DW$T$38, DW_AT_decl_line(0x3e)
    1605        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1606        .dwendtag $C$DW$T$38
    1607
    1608$C$DW$T$78      .dwtag  DW_TAG_volatile_type
    1609        .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$38)
    1610
    1611
    1612$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1613        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1614$C$DW$114       .dwtag  DW_TAG_member
    1615        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1616        .dwattr $C$DW$114, DW_AT_name("BITWISE_ENS")
    1617        .dwattr $C$DW$114, DW_AT_TI_symbol_name("BITWISE_ENS")
    1618        .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    1619        .dwattr $C$DW$114, DW_AT_bit_size(0x20)
    1620        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1622        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1623        .dwattr $C$DW$114, DW_AT_decl_line(0x4a)
    1624        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1625
    1626        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1627        .dwattr $C$DW$T$39, DW_AT_decl_line(0x49)
    1628        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1629        .dwendtag $C$DW$T$39
    1630
    1631$C$DW$T$80      .dwtag  DW_TAG_volatile_type
    1632        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$39)
    1633
    1634
    1635$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1636        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1637$C$DW$115       .dwtag  DW_TAG_member
    1638        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1639        .dwattr $C$DW$115, DW_AT_name("CYCLECOUNT")
    1640        .dwattr $C$DW$115, DW_AT_TI_symbol_name("CYCLECOUNT")
    1641        .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
