PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.3.3 *
       3;* Date/Time created: Sun Apr 27 21:36:03 2025                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("src/main_pru1.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.3.3 Copyright (c) 2012-2018 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/remotefio_api/BBRemotePRU/pru_firmware")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable
      16        .dwattr $C$DW$1, DW_AT_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      18        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]

      57        .dwattr $C$DW$3, DW_AT_external
      58        .dwattr $C$DW$3, DW_AT_decl_file("src/main_pru1.c")
      59        .dwattr $C$DW$3, DW_AT_decl_line(0x2c)
      60        .dwattr $C$DW$3, DW_AT_decl_column(0x0d)
      61        .dwendtag $C$DW$3
      62
      63;       /usr/bin/optpru /tmp/TI0Hp0A00LK /tmp/TI0HpsnMCZl 
      64;       /usr/bin/acpiapru -@/tmp/TI0HpQJzpds 
      65 00000000                         .sect   ".text:main"
      66        .clink
      67        .global ||main||
      68
      69$C$DW$4 .dwtag  DW_TAG_subprogram
      70        .dwattr $C$DW$4, DW_AT_name("main")
      71        .dwattr $C$DW$4, DW_AT_low_pc(||main||)
      72        .dwattr $C$DW$4, DW_AT_high_pc(0x00)
      73        .dwattr $C$DW$4, DW_AT_TI_symbol_name("main")
      74        .dwattr $C$DW$4, DW_AT_external
      75        .dwattr $C$DW$4, DW_AT_TI_begin_file("src/main_pru1.c")
      76        .dwattr $C$DW$4, DW_AT_TI_begin_line(0x2e)
      77        .dwattr $C$DW$4, DW_AT_TI_begin_column(0x06)
      78        .dwattr $C$DW$4, DW_AT_decl_file("src/main_pru1.c")
      79        .dwattr $C$DW$4, DW_AT_decl_line(0x2e)
      80        .dwattr $C$DW$4, DW_AT_decl_column(0x06)
      81        .dwattr $C$DW$4, DW_AT_TI_max_frame_size(0x02)
      82        .dwpsn  file "src/main_pru1.c",line 47,column 1,is_stmt,address ||main||,isa 0
      83
      84        .dwfde $C$DW$CIE, ||main||
      85;----------------------------------------------------------------------
      86;  46 | void main(void)                                                        
      87;----------------------------------------------------------------------
      88
      89;***************************************************************
      90;* FNAME: main                          FR SIZE:   2           *
      91;*                                                             *
      92;* FUNCTION ENVIRONMENT                                        *
      93;*                                                             *
      94;* FUNCTION PROPERTIES                                         *
      95;*                            0 Auto,  2 SOE     *
      96;***************************************************************
      97
      98 00000000                 ||main||:
      99;* --------------------------------------------------------------------------*
     100        .dwcfi  cfa_offset, 0
     101 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
     102        .dwcfi  cfa_offset, 2
     103        .dwpsn  file "src/main_pru1.c",line 49,column 2,is_stmt,isa 0
     104;----------------------------------------------------------------------
     105;  49 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
     106;----------------------------------------------------------------------
     107 00000004 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |49| CT_CFG
     108 00000008 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     109        .dwcfi  save_reg_to_mem, 14, -2
     110        .dwcfi  save_reg_to_mem, 15, -1
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    3

     111 0000000c 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |49| 
     112 00000010 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |49| CT_CFG
     113        .dwpsn  file "src/main_pru1.c",line 51,column 2,is_stmt,isa 0
     114;----------------------------------------------------------------------
     115;  51 | start();                                                               
     116;----------------------------------------------------------------------
     117$C$DW$5 .dwtag  DW_TAG_TI_branch
     118        .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     119        .dwattr $C$DW$5, DW_AT_name("start")
     120        .dwattr $C$DW$5, DW_AT_TI_call
     121
     122 00000014 000000230000C3!         JAL       r3.w2, ||start||      ; [ALU_PRU] |51| start
     123 00000018 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     124        .dwcfi  restore_reg, 14
     125        .dwcfi  restore_reg, 15
     126 0000001c 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
     127        .dwcfi  cfa_offset, 0
     128$C$DW$6 .dwtag  DW_TAG_TI_branch
     129        .dwattr $C$DW$6, DW_AT_low_pc(0x00)
     130        .dwattr $C$DW$6, DW_AT_TI_return
     131
     132 00000020 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     133        .dwattr $C$DW$4, DW_AT_TI_end_file("src/main_pru1.c")
     134        .dwattr $C$DW$4, DW_AT_TI_end_line(0x34)
     135        .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     136        .dwendentry
     137        .dwendtag $C$DW$4
     138
     139;*****************************************************************************
     140;* UNDEFINED EXTERNAL REFERENCES                                             *
     141;*****************************************************************************
     142        .global ||start||
     143
     144;******************************************************************************
     145;* TYPE INFORMATION                                                           *
     146;******************************************************************************
     147
     148$C$DW$T$19      .dwtag  DW_TAG_structure_type
     149        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     150$C$DW$7 .dwtag  DW_TAG_member
     151        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     152        .dwattr $C$DW$7, DW_AT_name("REVID")
     153        .dwattr $C$DW$7, DW_AT_TI_symbol_name("REVID")
     154        .dwattr $C$DW$7, DW_AT_bit_offset(0x00)
     155        .dwattr $C$DW$7, DW_AT_bit_size(0x20)
     156        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     157        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     158        .dwattr $C$DW$7, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335x
     159        .dwattr $C$DW$7, DW_AT_decl_line(0x2d)
     160        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     161
     162        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     163        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     164        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     165        .dwendtag $C$DW$T$19
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    4

     166
     167$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     168        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     169
     170
     171$C$DW$T$20      .dwtag  DW_TAG_structure_type
     172        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     173$C$DW$8 .dwtag  DW_TAG_member
     174        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     175        .dwattr $C$DW$8, DW_AT_name("IDLE_MODE")
     176        .dwattr $C$DW$8, DW_AT_TI_symbol_name("IDLE_MODE")
     177        .dwattr $C$DW$8, DW_AT_bit_offset(0x1e)
     178        .dwattr $C$DW$8, DW_AT_bit_size(0x02)
     179        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     180        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     181        .dwattr $C$DW$8, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335x
     182        .dwattr $C$DW$8, DW_AT_decl_line(0x37)
     183        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     184
     185$C$DW$9 .dwtag  DW_TAG_member
     186        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     187        .dwattr $C$DW$9, DW_AT_name("STANDBY_MODE")
     188        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_MODE")
     189        .dwattr $C$DW$9, DW_AT_bit_offset(0x1c)
     190        .dwattr $C$DW$9, DW_AT_bit_size(0x02)
     191        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     192        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     193        .dwattr $C$DW$9, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335x
     194        .dwattr $C$DW$9, DW_AT_decl_line(0x38)
     195        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     196
     197$C$DW$10        .dwtag  DW_TAG_member
     198        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     199        .dwattr $C$DW$10, DW_AT_name("STANDBY_INIT")
     200        .dwattr $C$DW$10, DW_AT_TI_symbol_name("STANDBY_INIT")
     201        .dwattr $C$DW$10, DW_AT_bit_offset(0x1b)
     202        .dwattr $C$DW$10, DW_AT_bit_size(0x01)
     203        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     204        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     205        .dwattr $C$DW$10, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     206        .dwattr $C$DW$10, DW_AT_decl_line(0x39)
     207        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     208
     209$C$DW$11        .dwtag  DW_TAG_member
     210        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     211        .dwattr $C$DW$11, DW_AT_name("SUB_MWAIT")
     212        .dwattr $C$DW$11, DW_AT_TI_symbol_name("SUB_MWAIT")
     213        .dwattr $C$DW$11, DW_AT_bit_offset(0x1a)
     214        .dwattr $C$DW$11, DW_AT_bit_size(0x01)
     215        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     216        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     217        .dwattr $C$DW$11, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     218        .dwattr $C$DW$11, DW_AT_decl_line(0x3a)
     219        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     220
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    5

     221$C$DW$12        .dwtag  DW_TAG_member
     222        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     223        .dwattr $C$DW$12, DW_AT_name("rsvd6")
     224        .dwattr $C$DW$12, DW_AT_TI_symbol_name("rsvd6")
     225        .dwattr $C$DW$12, DW_AT_bit_offset(0x00)
     226        .dwattr $C$DW$12, DW_AT_bit_size(0x1a)
     227        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     228        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     229        .dwattr $C$DW$12, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     230        .dwattr $C$DW$12, DW_AT_decl_line(0x3b)
     231        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     232
     233        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     234        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     235        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     236        .dwendtag $C$DW$T$20
     237
     238$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     239        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     240
     241
     242$C$DW$T$21      .dwtag  DW_TAG_structure_type
     243        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     244$C$DW$13        .dwtag  DW_TAG_member
     245        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     246        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_MODE")
     247        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     248        .dwattr $C$DW$13, DW_AT_bit_offset(0x1e)
     249        .dwattr $C$DW$13, DW_AT_bit_size(0x02)
     250        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     251        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     252        .dwattr $C$DW$13, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     253        .dwattr $C$DW$13, DW_AT_decl_line(0x45)
     254        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     255
     256$C$DW$14        .dwtag  DW_TAG_member
     257        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     258        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_CLK_MODE")
     259        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     260        .dwattr $C$DW$14, DW_AT_bit_offset(0x1d)
     261        .dwattr $C$DW$14, DW_AT_bit_size(0x01)
     262        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     263        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     264        .dwattr $C$DW$14, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     265        .dwattr $C$DW$14, DW_AT_decl_line(0x46)
     266        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     267
     268$C$DW$15        .dwtag  DW_TAG_member
     269        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     270        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV0")
     271        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     272        .dwattr $C$DW$15, DW_AT_bit_offset(0x18)
     273        .dwattr $C$DW$15, DW_AT_bit_size(0x05)
     274        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     275        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    6

     276        .dwattr $C$DW$15, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     277        .dwattr $C$DW$15, DW_AT_decl_line(0x47)
     278        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     279
     280$C$DW$16        .dwtag  DW_TAG_member
     281        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     282        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_DIV1")
     283        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     284        .dwattr $C$DW$16, DW_AT_bit_offset(0x13)
     285        .dwattr $C$DW$16, DW_AT_bit_size(0x05)
     286        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     288        .dwattr $C$DW$16, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     289        .dwattr $C$DW$16, DW_AT_decl_line(0x48)
     290        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     291
     292$C$DW$17        .dwtag  DW_TAG_member
     293        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     294        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_SB")
     295        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     296        .dwattr $C$DW$17, DW_AT_bit_offset(0x12)
     297        .dwattr $C$DW$17, DW_AT_bit_size(0x01)
     298        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     299        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     300        .dwattr $C$DW$17, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     301        .dwattr $C$DW$17, DW_AT_decl_line(0x49)
     302        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     303
     304$C$DW$18        .dwtag  DW_TAG_member
     305        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     306        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_MODE")
     307        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     308        .dwattr $C$DW$18, DW_AT_bit_offset(0x11)
     309        .dwattr $C$DW$18, DW_AT_bit_size(0x01)
     310        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     311        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     312        .dwattr $C$DW$18, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     313        .dwattr $C$DW$18, DW_AT_decl_line(0x4a)
     314        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     315
     316$C$DW$19        .dwtag  DW_TAG_member
     317        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     318        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV0")
     319        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     320        .dwattr $C$DW$19, DW_AT_bit_offset(0x0c)
     321        .dwattr $C$DW$19, DW_AT_bit_size(0x05)
     322        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     323        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     324        .dwattr $C$DW$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     325        .dwattr $C$DW$19, DW_AT_decl_line(0x4b)
     326        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     327
     328$C$DW$20        .dwtag  DW_TAG_member
     329        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     330        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_DIV1")
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    7

     331        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     332        .dwattr $C$DW$20, DW_AT_bit_offset(0x07)
     333        .dwattr $C$DW$20, DW_AT_bit_size(0x05)
     334        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     335        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     336        .dwattr $C$DW$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     337        .dwattr $C$DW$20, DW_AT_decl_line(0x4c)
     338        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     339
     340$C$DW$21        .dwtag  DW_TAG_member
     341        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     342        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_SH_SEL")
     343        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     344        .dwattr $C$DW$21, DW_AT_bit_offset(0x06)
     345        .dwattr $C$DW$21, DW_AT_bit_size(0x01)
     346        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     347        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     348        .dwattr $C$DW$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     349        .dwattr $C$DW$21, DW_AT_decl_line(0x4d)
     350        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     351
     352$C$DW$22        .dwtag  DW_TAG_member
     353        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     354        .dwattr $C$DW$22, DW_AT_name("rsvd26")
     355        .dwattr $C$DW$22, DW_AT_TI_symbol_name("rsvd26")
     356        .dwattr $C$DW$22, DW_AT_bit_offset(0x00)
     357        .dwattr $C$DW$22, DW_AT_bit_size(0x06)
     358        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     359        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     360        .dwattr $C$DW$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     361        .dwattr $C$DW$22, DW_AT_decl_line(0x4e)
     362        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     363
     364        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     365        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     366        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     367        .dwendtag $C$DW$T$21
     368
     369$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     370        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     371
     372
     373$C$DW$T$22      .dwtag  DW_TAG_structure_type
     374        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     375$C$DW$23        .dwtag  DW_TAG_member
     376        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     377        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_MODE")
     378        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     379        .dwattr $C$DW$23, DW_AT_bit_offset(0x1e)
     380        .dwattr $C$DW$23, DW_AT_bit_size(0x02)
     381        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     382        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     383        .dwattr $C$DW$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     384        .dwattr $C$DW$23, DW_AT_decl_line(0x58)
     385        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    8

     386
     387$C$DW$24        .dwtag  DW_TAG_member
     388        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     389        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_CLK_MODE")
     390        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     391        .dwattr $C$DW$24, DW_AT_bit_offset(0x1d)
     392        .dwattr $C$DW$24, DW_AT_bit_size(0x01)
     393        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     394        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     395        .dwattr $C$DW$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     396        .dwattr $C$DW$24, DW_AT_decl_line(0x59)
     397        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     398
     399$C$DW$25        .dwtag  DW_TAG_member
     400        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     401        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV0")
     402        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     403        .dwattr $C$DW$25, DW_AT_bit_offset(0x18)
     404        .dwattr $C$DW$25, DW_AT_bit_size(0x05)
     405        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     406        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     407        .dwattr $C$DW$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     408        .dwattr $C$DW$25, DW_AT_decl_line(0x5a)
     409        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     410
     411$C$DW$26        .dwtag  DW_TAG_member
     412        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     413        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_DIV1")
     414        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     415        .dwattr $C$DW$26, DW_AT_bit_offset(0x13)
     416        .dwattr $C$DW$26, DW_AT_bit_size(0x05)
     417        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     418        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     419        .dwattr $C$DW$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     420        .dwattr $C$DW$26, DW_AT_decl_line(0x5b)
     421        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     422
     423$C$DW$27        .dwtag  DW_TAG_member
     424        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     425        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_SB")
     426        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     427        .dwattr $C$DW$27, DW_AT_bit_offset(0x12)
     428        .dwattr $C$DW$27, DW_AT_bit_size(0x01)
     429        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     430        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     431        .dwattr $C$DW$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     432        .dwattr $C$DW$27, DW_AT_decl_line(0x5c)
     433        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     434
     435$C$DW$28        .dwtag  DW_TAG_member
     436        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     437        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_MODE")
     438        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     439        .dwattr $C$DW$28, DW_AT_bit_offset(0x11)
     440        .dwattr $C$DW$28, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    9

     441        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     442        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     443        .dwattr $C$DW$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     444        .dwattr $C$DW$28, DW_AT_decl_line(0x5d)
     445        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     446
     447$C$DW$29        .dwtag  DW_TAG_member
     448        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     449        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV0")
     450        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     451        .dwattr $C$DW$29, DW_AT_bit_offset(0x0c)
     452        .dwattr $C$DW$29, DW_AT_bit_size(0x05)
     453        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     454        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     455        .dwattr $C$DW$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     456        .dwattr $C$DW$29, DW_AT_decl_line(0x5e)
     457        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     458
     459$C$DW$30        .dwtag  DW_TAG_member
     460        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     461        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_DIV1")
     462        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     463        .dwattr $C$DW$30, DW_AT_bit_offset(0x07)
     464        .dwattr $C$DW$30, DW_AT_bit_size(0x05)
     465        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     466        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     467        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     468        .dwattr $C$DW$30, DW_AT_decl_line(0x5f)
     469        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     470
     471$C$DW$31        .dwtag  DW_TAG_member
     472        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     473        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_SH_SEL")
     474        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     475        .dwattr $C$DW$31, DW_AT_bit_offset(0x06)
     476        .dwattr $C$DW$31, DW_AT_bit_size(0x01)
     477        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     478        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     479        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     480        .dwattr $C$DW$31, DW_AT_decl_line(0x60)
     481        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     482
     483$C$DW$32        .dwtag  DW_TAG_member
     484        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     485        .dwattr $C$DW$32, DW_AT_name("rsvd26")
     486        .dwattr $C$DW$32, DW_AT_TI_symbol_name("rsvd26")
     487        .dwattr $C$DW$32, DW_AT_bit_offset(0x00)
     488        .dwattr $C$DW$32, DW_AT_bit_size(0x06)
     489        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     490        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     491        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     492        .dwattr $C$DW$32, DW_AT_decl_line(0x61)
     493        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     494
     495        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   10

     496        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     497        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     498        .dwendtag $C$DW$T$22
     499
     500$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     501        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     502
     503
     504$C$DW$T$23      .dwtag  DW_TAG_structure_type
     505        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     506$C$DW$33        .dwtag  DW_TAG_member
     507        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     508        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_REQ")
     509        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     510        .dwattr $C$DW$33, DW_AT_bit_offset(0x1f)
     511        .dwattr $C$DW$33, DW_AT_bit_size(0x01)
     512        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     513        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     514        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     515        .dwattr $C$DW$33, DW_AT_decl_line(0x6b)
     516        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     517
     518$C$DW$34        .dwtag  DW_TAG_member
     519        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     520        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_STOP_ACK")
     521        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     522        .dwattr $C$DW$34, DW_AT_bit_offset(0x1e)
     523        .dwattr $C$DW$34, DW_AT_bit_size(0x01)
     524        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     525        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     526        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     527        .dwattr $C$DW$34, DW_AT_decl_line(0x6c)
     528        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     529
     530$C$DW$35        .dwtag  DW_TAG_member
     531        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     532        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_EN")
     533        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     534        .dwattr $C$DW$35, DW_AT_bit_offset(0x1d)
     535        .dwattr $C$DW$35, DW_AT_bit_size(0x01)
     536        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     538        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     539        .dwattr $C$DW$35, DW_AT_decl_line(0x6d)
     540        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     541
     542$C$DW$36        .dwtag  DW_TAG_member
     543        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     544        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_REQ")
     545        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     546        .dwattr $C$DW$36, DW_AT_bit_offset(0x1c)
     547        .dwattr $C$DW$36, DW_AT_bit_size(0x01)
     548        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     549        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     550        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   11

     551        .dwattr $C$DW$36, DW_AT_decl_line(0x6e)
     552        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     553
     554$C$DW$37        .dwtag  DW_TAG_member
     555        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     556        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_STOP_ACK")
     557        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     558        .dwattr $C$DW$37, DW_AT_bit_offset(0x1b)
     559        .dwattr $C$DW$37, DW_AT_bit_size(0x01)
     560        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     561        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     562        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     563        .dwattr $C$DW$37, DW_AT_decl_line(0x6f)
     564        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     565
     566$C$DW$38        .dwtag  DW_TAG_member
     567        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     568        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_EN")
     569        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     570        .dwattr $C$DW$38, DW_AT_bit_offset(0x1a)
     571        .dwattr $C$DW$38, DW_AT_bit_size(0x01)
     572        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     573        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     574        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     575        .dwattr $C$DW$38, DW_AT_decl_line(0x70)
     576        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     577
     578$C$DW$39        .dwtag  DW_TAG_member
     579        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     580        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_REQ")
     581        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     582        .dwattr $C$DW$39, DW_AT_bit_offset(0x19)
     583        .dwattr $C$DW$39, DW_AT_bit_size(0x01)
     584        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     586        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     587        .dwattr $C$DW$39, DW_AT_decl_line(0x71)
     588        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     589
     590$C$DW$40        .dwtag  DW_TAG_member
     591        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     592        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_STOP_ACK")
     593        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     594        .dwattr $C$DW$40, DW_AT_bit_offset(0x18)
     595        .dwattr $C$DW$40, DW_AT_bit_size(0x01)
     596        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     598        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     599        .dwattr $C$DW$40, DW_AT_decl_line(0x72)
     600        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     601
     602$C$DW$41        .dwtag  DW_TAG_member
     603        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     604        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_EN")
     605        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_EN")
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   12

     606        .dwattr $C$DW$41, DW_AT_bit_offset(0x17)
     607        .dwattr $C$DW$41, DW_AT_bit_size(0x01)
     608        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     610        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     611        .dwattr $C$DW$41, DW_AT_decl_line(0x73)
     612        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     613
     614$C$DW$42        .dwtag  DW_TAG_member
     615        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     616        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_REQ")
     617        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     618        .dwattr $C$DW$42, DW_AT_bit_offset(0x16)
     619        .dwattr $C$DW$42, DW_AT_bit_size(0x01)
     620        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     622        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     623        .dwattr $C$DW$42, DW_AT_decl_line(0x74)
     624        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     625
     626$C$DW$43        .dwtag  DW_TAG_member
     627        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     628        .dwattr $C$DW$43, DW_AT_name("UART_CLK_STOP_ACK")
     629        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     630        .dwattr $C$DW$43, DW_AT_bit_offset(0x15)
     631        .dwattr $C$DW$43, DW_AT_bit_size(0x01)
     632        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     633        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     634        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     635        .dwattr $C$DW$43, DW_AT_decl_line(0x75)
     636        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     637
     638$C$DW$44        .dwtag  DW_TAG_member
     639        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     640        .dwattr $C$DW$44, DW_AT_name("UART_CLK_EN")
     641        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_EN")
     642        .dwattr $C$DW$44, DW_AT_bit_offset(0x14)
     643        .dwattr $C$DW$44, DW_AT_bit_size(0x01)
     644        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     646        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     647        .dwattr $C$DW$44, DW_AT_decl_line(0x76)
     648        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     649
     650$C$DW$45        .dwtag  DW_TAG_member
     651        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     652        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_REQ")
     653        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     654        .dwattr $C$DW$45, DW_AT_bit_offset(0x13)
     655        .dwattr $C$DW$45, DW_AT_bit_size(0x01)
     656        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     657        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     658        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     659        .dwattr $C$DW$45, DW_AT_decl_line(0x77)
     660        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   13

     661
     662$C$DW$46        .dwtag  DW_TAG_member
     663        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     664        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_STOP_ACK")
     665        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     666        .dwattr $C$DW$46, DW_AT_bit_offset(0x12)
     667        .dwattr $C$DW$46, DW_AT_bit_size(0x01)
     668        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     670        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     671        .dwattr $C$DW$46, DW_AT_decl_line(0x78)
     672        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     673
     674$C$DW$47        .dwtag  DW_TAG_member
     675        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     676        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_EN")
     677        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     678        .dwattr $C$DW$47, DW_AT_bit_offset(0x11)
     679        .dwattr $C$DW$47, DW_AT_bit_size(0x01)
     680        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     682        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     683        .dwattr $C$DW$47, DW_AT_decl_line(0x79)
     684        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     685
     686$C$DW$48        .dwtag  DW_TAG_member
     687        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     688        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_REQ")
     689        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     690        .dwattr $C$DW$48, DW_AT_bit_offset(0x10)
     691        .dwattr $C$DW$48, DW_AT_bit_size(0x01)
     692        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     693        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     694        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     695        .dwattr $C$DW$48, DW_AT_decl_line(0x7a)
     696        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     697
     698$C$DW$49        .dwtag  DW_TAG_member
     699        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     700        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_STOP_ACK")
     701        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     702        .dwattr $C$DW$49, DW_AT_bit_offset(0x0f)
     703        .dwattr $C$DW$49, DW_AT_bit_size(0x01)
     704        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     706        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     707        .dwattr $C$DW$49, DW_AT_decl_line(0x7b)
     708        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     709
     710$C$DW$50        .dwtag  DW_TAG_member
     711        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     712        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_EN")
     713        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_EN")
     714        .dwattr $C$DW$50, DW_AT_bit_offset(0x0e)
     715        .dwattr $C$DW$50, DW_AT_bit_size(0x01)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   14

     716        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     718        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     719        .dwattr $C$DW$50, DW_AT_decl_line(0x7c)
     720        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     721
     722$C$DW$51        .dwtag  DW_TAG_member
     723        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     724        .dwattr $C$DW$51, DW_AT_name("rsvd18")
     725        .dwattr $C$DW$51, DW_AT_TI_symbol_name("rsvd18")
     726        .dwattr $C$DW$51, DW_AT_bit_offset(0x00)
     727        .dwattr $C$DW$51, DW_AT_bit_size(0x0e)
     728        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     730        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     731        .dwattr $C$DW$51, DW_AT_decl_line(0x7d)
     732        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     733
     734        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     735        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     736        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     737        .dwendtag $C$DW$T$23
     738
     739$C$DW$T$45      .dwtag  DW_TAG_volatile_type
     740        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     741
     742
     743$C$DW$T$24      .dwtag  DW_TAG_structure_type
     744        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     745$C$DW$52        .dwtag  DW_TAG_member
     746        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     747        .dwattr $C$DW$52, DW_AT_name("PRU0_IMEM_PE_RAW")
     748        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     749        .dwattr $C$DW$52, DW_AT_bit_offset(0x1c)
     750        .dwattr $C$DW$52, DW_AT_bit_size(0x04)
     751        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     753        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     754        .dwattr $C$DW$52, DW_AT_decl_line(0x87)
     755        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     756
     757$C$DW$53        .dwtag  DW_TAG_member
     758        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     759        .dwattr $C$DW$53, DW_AT_name("PRU0_DMEM_PE_RAW")
     760        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     761        .dwattr $C$DW$53, DW_AT_bit_offset(0x18)
     762        .dwattr $C$DW$53, DW_AT_bit_size(0x04)
     763        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     765        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     766        .dwattr $C$DW$53, DW_AT_decl_line(0x88)
     767        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     768
     769$C$DW$54        .dwtag  DW_TAG_member
     770        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   15

     771        .dwattr $C$DW$54, DW_AT_name("PRU1_IMEM_PE_RAW")
     772        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     773        .dwattr $C$DW$54, DW_AT_bit_offset(0x14)
     774        .dwattr $C$DW$54, DW_AT_bit_size(0x04)
     775        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     777        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     778        .dwattr $C$DW$54, DW_AT_decl_line(0x89)
     779        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     780
     781$C$DW$55        .dwtag  DW_TAG_member
     782        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     783        .dwattr $C$DW$55, DW_AT_name("PRU1_DMEM_PE_RAW")
     784        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     785        .dwattr $C$DW$55, DW_AT_bit_offset(0x10)
     786        .dwattr $C$DW$55, DW_AT_bit_size(0x04)
     787        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     789        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     790        .dwattr $C$DW$55, DW_AT_decl_line(0x8a)
     791        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     792
     793$C$DW$56        .dwtag  DW_TAG_member
     794        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     795        .dwattr $C$DW$56, DW_AT_name("RAM_PE_RAW")
     796        .dwattr $C$DW$56, DW_AT_TI_symbol_name("RAM_PE_RAW")
     797        .dwattr $C$DW$56, DW_AT_bit_offset(0x0c)
     798        .dwattr $C$DW$56, DW_AT_bit_size(0x04)
     799        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     800        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     801        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     802        .dwattr $C$DW$56, DW_AT_decl_line(0x8b)
     803        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     804
     805$C$DW$57        .dwtag  DW_TAG_member
     806        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     807        .dwattr $C$DW$57, DW_AT_name("rsvd20")
     808        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd20")
     809        .dwattr $C$DW$57, DW_AT_bit_offset(0x00)
     810        .dwattr $C$DW$57, DW_AT_bit_size(0x0c)
     811        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     812        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     813        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     814        .dwattr $C$DW$57, DW_AT_decl_line(0x8c)
     815        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     816
     817        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     818        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     819        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     820        .dwendtag $C$DW$T$24
     821
     822$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     823        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
     824
     825
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   16

     826$C$DW$T$25      .dwtag  DW_TAG_structure_type
     827        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     828$C$DW$58        .dwtag  DW_TAG_member
     829        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     830        .dwattr $C$DW$58, DW_AT_name("PRU0_IMEM_PE")
     831        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     832        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c)
     833        .dwattr $C$DW$58, DW_AT_bit_size(0x04)
     834        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     836        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     837        .dwattr $C$DW$58, DW_AT_decl_line(0x96)
     838        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     839
     840$C$DW$59        .dwtag  DW_TAG_member
     841        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     842        .dwattr $C$DW$59, DW_AT_name("PRU0_DMEM_PE")
     843        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     844        .dwattr $C$DW$59, DW_AT_bit_offset(0x18)
     845        .dwattr $C$DW$59, DW_AT_bit_size(0x04)
     846        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     848        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     849        .dwattr $C$DW$59, DW_AT_decl_line(0x97)
     850        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     851
     852$C$DW$60        .dwtag  DW_TAG_member
     853        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     854        .dwattr $C$DW$60, DW_AT_name("PRU1_IMEM_PE")
     855        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     856        .dwattr $C$DW$60, DW_AT_bit_offset(0x14)
     857        .dwattr $C$DW$60, DW_AT_bit_size(0x04)
     858        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     860        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     861        .dwattr $C$DW$60, DW_AT_decl_line(0x98)
     862        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     863
     864$C$DW$61        .dwtag  DW_TAG_member
     865        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     866        .dwattr $C$DW$61, DW_AT_name("PRU1_DMEM_PE")
     867        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     868        .dwattr $C$DW$61, DW_AT_bit_offset(0x10)
     869        .dwattr $C$DW$61, DW_AT_bit_size(0x04)
     870        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     872        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     873        .dwattr $C$DW$61, DW_AT_decl_line(0x99)
     874        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     875
     876$C$DW$62        .dwtag  DW_TAG_member
     877        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     878        .dwattr $C$DW$62, DW_AT_name("RAM_PE")
     879        .dwattr $C$DW$62, DW_AT_TI_symbol_name("RAM_PE")
     880        .dwattr $C$DW$62, DW_AT_bit_offset(0x0c)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   17

     881        .dwattr $C$DW$62, DW_AT_bit_size(0x04)
     882        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     883        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     884        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     885        .dwattr $C$DW$62, DW_AT_decl_line(0x9a)
     886        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     887
     888$C$DW$63        .dwtag  DW_TAG_member
     889        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     890        .dwattr $C$DW$63, DW_AT_name("rsvd20")
     891        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd20")
     892        .dwattr $C$DW$63, DW_AT_bit_offset(0x00)
     893        .dwattr $C$DW$63, DW_AT_bit_size(0x0c)
     894        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     896        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     897        .dwattr $C$DW$63, DW_AT_decl_line(0x9b)
     898        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     899
     900        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     901        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     902        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     903        .dwendtag $C$DW$T$25
     904
     905$C$DW$T$49      .dwtag  DW_TAG_volatile_type
     906        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
     907
     908
     909$C$DW$T$26      .dwtag  DW_TAG_structure_type
     910        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     911$C$DW$64        .dwtag  DW_TAG_member
     912        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     913        .dwattr $C$DW$64, DW_AT_name("PRU0_IMEM_PE_SET")
     914        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     915        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c)
     916        .dwattr $C$DW$64, DW_AT_bit_size(0x04)
     917        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     918        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     919        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     920        .dwattr $C$DW$64, DW_AT_decl_line(0xa4)
     921        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     922
     923$C$DW$65        .dwtag  DW_TAG_member
     924        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     925        .dwattr $C$DW$65, DW_AT_name("PRU0_DMEM_PE_SET")
     926        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     927        .dwattr $C$DW$65, DW_AT_bit_offset(0x18)
     928        .dwattr $C$DW$65, DW_AT_bit_size(0x04)
     929        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     931        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     932        .dwattr $C$DW$65, DW_AT_decl_line(0xa5)
     933        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     934
     935$C$DW$66        .dwtag  DW_TAG_member
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   18

     936        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     937        .dwattr $C$DW$66, DW_AT_name("PRU1_IMEM_PE_SET")
     938        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     939        .dwattr $C$DW$66, DW_AT_bit_offset(0x14)
     940        .dwattr $C$DW$66, DW_AT_bit_size(0x04)
     941        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     943        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     944        .dwattr $C$DW$66, DW_AT_decl_line(0xa6)
     945        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     946
     947$C$DW$67        .dwtag  DW_TAG_member
     948        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     949        .dwattr $C$DW$67, DW_AT_name("PRU1_DMEM_PE_SET")
     950        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     951        .dwattr $C$DW$67, DW_AT_bit_offset(0x10)
     952        .dwattr $C$DW$67, DW_AT_bit_size(0x04)
     953        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     955        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     956        .dwattr $C$DW$67, DW_AT_decl_line(0xa7)
     957        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     958
     959$C$DW$68        .dwtag  DW_TAG_member
     960        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     961        .dwattr $C$DW$68, DW_AT_name("RAM_PE_SET")
     962        .dwattr $C$DW$68, DW_AT_TI_symbol_name("RAM_PE_SET")
     963        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c)
     964        .dwattr $C$DW$68, DW_AT_bit_size(0x04)
     965        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     967        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     968        .dwattr $C$DW$68, DW_AT_decl_line(0xa8)
     969        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     970
     971$C$DW$69        .dwtag  DW_TAG_member
     972        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     973        .dwattr $C$DW$69, DW_AT_name("rsvd20")
     974        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd20")
     975        .dwattr $C$DW$69, DW_AT_bit_offset(0x00)
     976        .dwattr $C$DW$69, DW_AT_bit_size(0x0c)
     977        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     979        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
     980        .dwattr $C$DW$69, DW_AT_decl_line(0xa9)
     981        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     982
     983        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
     984        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     985        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     986        .dwendtag $C$DW$T$26
     987
     988$C$DW$T$51      .dwtag  DW_TAG_volatile_type
     989        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
     990
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   19

     991
     992$C$DW$T$27      .dwtag  DW_TAG_structure_type
     993        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     994$C$DW$70        .dwtag  DW_TAG_member
     995        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     996        .dwattr $C$DW$70, DW_AT_name("PRU0_IMEM_PE_CLR")
     997        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     998        .dwattr $C$DW$70, DW_AT_bit_offset(0x1c)
     999        .dwattr $C$DW$70, DW_AT_bit_size(0x04)
    1000        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1002        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1003        .dwattr $C$DW$70, DW_AT_decl_line(0xb3)
    1004        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1005
    1006$C$DW$71        .dwtag  DW_TAG_member
    1007        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1008        .dwattr $C$DW$71, DW_AT_name("PRU0_DMEM_PE_CLR")
    1009        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1010        .dwattr $C$DW$71, DW_AT_bit_offset(0x18)
    1011        .dwattr $C$DW$71, DW_AT_bit_size(0x04)
    1012        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1014        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1015        .dwattr $C$DW$71, DW_AT_decl_line(0xb4)
    1016        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1017
    1018$C$DW$72        .dwtag  DW_TAG_member
    1019        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1020        .dwattr $C$DW$72, DW_AT_name("PRU1_IMEM_PE_CLR")
    1021        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1022        .dwattr $C$DW$72, DW_AT_bit_offset(0x14)
    1023        .dwattr $C$DW$72, DW_AT_bit_size(0x04)
    1024        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1025        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1026        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1027        .dwattr $C$DW$72, DW_AT_decl_line(0xb5)
    1028        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1029
    1030$C$DW$73        .dwtag  DW_TAG_member
    1031        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1032        .dwattr $C$DW$73, DW_AT_name("PRU1_DMEM_PE_CLR")
    1033        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1034        .dwattr $C$DW$73, DW_AT_bit_offset(0x10)
    1035        .dwattr $C$DW$73, DW_AT_bit_size(0x04)
    1036        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1038        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1039        .dwattr $C$DW$73, DW_AT_decl_line(0xb6)
    1040        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1041
    1042$C$DW$74        .dwtag  DW_TAG_member
    1043        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1044        .dwattr $C$DW$74, DW_AT_name("rsvd16")
    1045        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd16")
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   20

    1046        .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1047        .dwattr $C$DW$74, DW_AT_bit_size(0x10)
    1048        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1050        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1051        .dwattr $C$DW$74, DW_AT_decl_line(0xb7)
    1052        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1053
    1054        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1055        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1056        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1057        .dwendtag $C$DW$T$27
    1058
    1059$C$DW$T$53      .dwtag  DW_TAG_volatile_type
    1060        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
    1061
    1062
    1063$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1064        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1065$C$DW$75        .dwtag  DW_TAG_member
    1066        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1067        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU0")
    1068        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU0")
    1069        .dwattr $C$DW$75, DW_AT_bit_offset(0x1f)
    1070        .dwattr $C$DW$75, DW_AT_bit_size(0x01)
    1071        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1073        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1074        .dwattr $C$DW$75, DW_AT_decl_line(0xc4)
    1075        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1076
    1077$C$DW$76        .dwtag  DW_TAG_member
    1078        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1079        .dwattr $C$DW$76, DW_AT_name("PMAO_PRU1")
    1080        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PMAO_PRU1")
    1081        .dwattr $C$DW$76, DW_AT_bit_offset(0x1e)
    1082        .dwattr $C$DW$76, DW_AT_bit_size(0x01)
    1083        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1085        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1086        .dwattr $C$DW$76, DW_AT_decl_line(0xc5)
    1087        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1088
    1089$C$DW$77        .dwtag  DW_TAG_member
    1090        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1091        .dwattr $C$DW$77, DW_AT_name("rsvd2")
    1092        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd2")
    1093        .dwattr $C$DW$77, DW_AT_bit_offset(0x00)
    1094        .dwattr $C$DW$77, DW_AT_bit_size(0x1e)
    1095        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1097        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1098        .dwattr $C$DW$77, DW_AT_decl_line(0xc6)
    1099        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1100
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   21

    1101        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1102        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1103        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1104        .dwendtag $C$DW$T$28
    1105
    1106$C$DW$T$55      .dwtag  DW_TAG_volatile_type
    1107        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
    1108
    1109
    1110$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1111        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1112$C$DW$78        .dwtag  DW_TAG_member
    1113        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1114        .dwattr $C$DW$78, DW_AT_name("OCP_EN")
    1115        .dwattr $C$DW$78, DW_AT_TI_symbol_name("OCP_EN")
    1116        .dwattr $C$DW$78, DW_AT_bit_offset(0x1f)
    1117        .dwattr $C$DW$78, DW_AT_bit_size(0x01)
    1118        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1120        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1121        .dwattr $C$DW$78, DW_AT_decl_line(0xd3)
    1122        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1123
    1124$C$DW$79        .dwtag  DW_TAG_member
    1125        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1126        .dwattr $C$DW$79, DW_AT_name("rsvd1")
    1127        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd1")
    1128        .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1129        .dwattr $C$DW$79, DW_AT_bit_size(0x1f)
    1130        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1132        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1133        .dwattr $C$DW$79, DW_AT_decl_line(0xd4)
    1134        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1135
    1136        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1137        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1138        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1139        .dwendtag $C$DW$T$29
    1140
    1141$C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1142        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
    1143
    1144
    1145$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1146        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1147$C$DW$80        .dwtag  DW_TAG_member
    1148        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1149        .dwattr $C$DW$80, DW_AT_name("PRU1_PAD_HP_EN")
    1150        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1151        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f)
    1152        .dwattr $C$DW$80, DW_AT_bit_size(0x01)
    1153        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1155        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   22

    1156        .dwattr $C$DW$80, DW_AT_decl_line(0xde)
    1157        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1158
    1159$C$DW$81        .dwtag  DW_TAG_member
    1160        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1161        .dwattr $C$DW$81, DW_AT_name("XFR_SHIFT_EN")
    1162        .dwattr $C$DW$81, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1163        .dwattr $C$DW$81, DW_AT_bit_offset(0x1e)
    1164        .dwattr $C$DW$81, DW_AT_bit_size(0x01)
    1165        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1166        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1167        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1168        .dwattr $C$DW$81, DW_AT_decl_line(0xdf)
    1169        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1170
    1171$C$DW$82        .dwtag  DW_TAG_member
    1172        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1173        .dwattr $C$DW$82, DW_AT_name("rsvd2")
    1174        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd2")
    1175        .dwattr $C$DW$82, DW_AT_bit_offset(0x00)
    1176        .dwattr $C$DW$82, DW_AT_bit_size(0x1e)
    1177        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1179        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1180        .dwattr $C$DW$82, DW_AT_decl_line(0xe0)
    1181        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1182
    1183        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1184        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1185        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1186        .dwendtag $C$DW$T$30
    1187
    1188$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1189        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1190
    1191
    1192$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1193        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1194$C$DW$83        .dwtag  DW_TAG_member
    1195        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1196        .dwattr $C$DW$83, DW_AT_name("PIN_MUX_SEL")
    1197        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1198        .dwattr $C$DW$83, DW_AT_bit_offset(0x18)
    1199        .dwattr $C$DW$83, DW_AT_bit_size(0x08)
    1200        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1202        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1203        .dwattr $C$DW$83, DW_AT_decl_line(0xec)
    1204        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1205
    1206$C$DW$84        .dwtag  DW_TAG_member
    1207        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1208        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1209        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1210        .dwattr $C$DW$84, DW_AT_bit_offset(0x00)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   23

    1211        .dwattr $C$DW$84, DW_AT_bit_size(0x18)
    1212        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1214        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1215        .dwattr $C$DW$84, DW_AT_decl_line(0xed)
    1216        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1217
    1218        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1219        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1220        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1221        .dwendtag $C$DW$T$31
    1222
    1223$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1224        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1225
    1226
    1227$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1228        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1229$C$DW$85        .dwtag  DW_TAG_member
    1230        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$38)
    1231        .dwattr $C$DW$85, DW_AT_name("$P$T0")
    1232        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T0")
    1233        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1235        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1236        .dwattr $C$DW$85, DW_AT_decl_line(0x29)
    1237        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1238
    1239$C$DW$86        .dwtag  DW_TAG_member
    1240        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$40)
    1241        .dwattr $C$DW$86, DW_AT_name("$P$T1")
    1242        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T1")
    1243        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1244        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1245        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1246        .dwattr $C$DW$86, DW_AT_decl_line(0x33)
    1247        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1248
    1249$C$DW$87        .dwtag  DW_TAG_member
    1250        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$42)
    1251        .dwattr $C$DW$87, DW_AT_name("$P$T2")
    1252        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T2")
    1253        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1254        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1255        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1256        .dwattr $C$DW$87, DW_AT_decl_line(0x41)
    1257        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1258
    1259$C$DW$88        .dwtag  DW_TAG_member
    1260        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$44)
    1261        .dwattr $C$DW$88, DW_AT_name("$P$T3")
    1262        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T3")
    1263        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1264        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1265        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   24

    1266        .dwattr $C$DW$88, DW_AT_decl_line(0x54)
    1267        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1268
    1269$C$DW$89        .dwtag  DW_TAG_member
    1270        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$46)
    1271        .dwattr $C$DW$89, DW_AT_name("$P$T4")
    1272        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T4")
    1273        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1274        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1275        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1276        .dwattr $C$DW$89, DW_AT_decl_line(0x67)
    1277        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1278
    1279$C$DW$90        .dwtag  DW_TAG_member
    1280        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$48)
    1281        .dwattr $C$DW$90, DW_AT_name("$P$T5")
    1282        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T5")
    1283        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1284        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1285        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1286        .dwattr $C$DW$90, DW_AT_decl_line(0x83)
    1287        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1288
    1289$C$DW$91        .dwtag  DW_TAG_member
    1290        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$50)
    1291        .dwattr $C$DW$91, DW_AT_name("$P$T6")
    1292        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T6")
    1293        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1294        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1295        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1296        .dwattr $C$DW$91, DW_AT_decl_line(0x92)
    1297        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1298
    1299$C$DW$92        .dwtag  DW_TAG_member
    1300        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$52)
    1301        .dwattr $C$DW$92, DW_AT_name("$P$T7")
    1302        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T7")
    1303        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1304        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1305        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1306        .dwattr $C$DW$92, DW_AT_decl_line(0xa0)
    1307        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1308
    1309$C$DW$93        .dwtag  DW_TAG_member
    1310        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$54)
    1311        .dwattr $C$DW$93, DW_AT_name("$P$T8")
    1312        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T8")
    1313        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1314        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1315        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1316        .dwattr $C$DW$93, DW_AT_decl_line(0xaf)
    1317        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1318
    1319$C$DW$94        .dwtag  DW_TAG_member
    1320        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   25

    1321        .dwattr $C$DW$94, DW_AT_name("rsvd24")
    1322        .dwattr $C$DW$94, DW_AT_TI_symbol_name("rsvd24")
    1323        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1324        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1325        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1326        .dwattr $C$DW$94, DW_AT_decl_line(0xbc)
    1327        .dwattr $C$DW$94, DW_AT_decl_column(0x0b)
    1328
    1329$C$DW$95        .dwtag  DW_TAG_member
    1330        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$56)
    1331        .dwattr $C$DW$95, DW_AT_name("$P$T9")
    1332        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T9")
    1333        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1334        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1335        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1336        .dwattr $C$DW$95, DW_AT_decl_line(0xc0)
    1337        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1338
    1339$C$DW$96        .dwtag  DW_TAG_member
    1340        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
    1341        .dwattr $C$DW$96, DW_AT_name("rsvd2c")
    1342        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd2c")
    1343        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1344        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1345        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1346        .dwattr $C$DW$96, DW_AT_decl_line(0xcb)
    1347        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1348
    1349$C$DW$97        .dwtag  DW_TAG_member
    1350        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$58)
    1351        .dwattr $C$DW$97, DW_AT_name("$P$T10")
    1352        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T10")
    1353        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1354        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1355        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1356        .dwattr $C$DW$97, DW_AT_decl_line(0xcf)
    1357        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1358
    1359$C$DW$98        .dwtag  DW_TAG_member
    1360        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$60)
    1361        .dwattr $C$DW$98, DW_AT_name("$P$T11")
    1362        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T11")
    1363        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1364        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1365        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
    1366        .dwattr $C$DW$98, DW_AT_decl_line(0xda)
    1367        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1368
    1369$C$DW$99        .dwtag  DW_TAG_member
    1370        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1371        .dwattr $C$DW$99, DW_AT_name("rsvd38")
    1372        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd38")
    1373        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1374        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1375        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am335
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   26

    1376        .dwattr $C$DW$99, DW_AT_decl_line(0xe5)
    1377        .dwattr $C$DW$99, DW_AT_decl_column(0x0b)
    1378
    1379$C$DW$100       .dwtag  DW_TAG_member
    1380        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$62)
    1381        .dwattr $C$DW$100, DW_AT_name("$P$T12")
    1382        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T12")
    1383        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1384        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1385        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1386        .dwattr $C$DW$100, DW_AT_decl_line(0xe8)
    1387        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1388
    1389        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1390        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1391        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1392        .dwendtag $C$DW$T$35
    1393
    1394$C$DW$T$68      .dwtag  DW_TAG_typedef
    1395        .dwattr $C$DW$T$68, DW_AT_name("pruCfg")
    1396        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$35)
    1397        .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1398        .dwattr $C$DW$T$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1399        .dwattr $C$DW$T$68, DW_AT_decl_line(0xf0)
    1400        .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1401
    1402$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1403        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1404
    1405
    1406$C$DW$T$38      .dwtag  DW_TAG_union_type
    1407        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1408$C$DW$101       .dwtag  DW_TAG_member
    1409        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$36)
    1410        .dwattr $C$DW$101, DW_AT_name("REVID")
    1411        .dwattr $C$DW$101, DW_AT_TI_symbol_name("REVID")
    1412        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1414        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1415        .dwattr $C$DW$101, DW_AT_decl_line(0x2a)
    1416        .dwattr $C$DW$101, DW_AT_decl_column(0x15)
    1417
    1418$C$DW$102       .dwtag  DW_TAG_member
    1419        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$37)
    1420        .dwattr $C$DW$102, DW_AT_name("REVID_bit")
    1421        .dwattr $C$DW$102, DW_AT_TI_symbol_name("REVID_bit")
    1422        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1424        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1425        .dwattr $C$DW$102, DW_AT_decl_line(0x2e)
    1426        .dwattr $C$DW$102, DW_AT_decl_column(0x05)
    1427
    1428        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1429        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
    1430        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   27

    1431        .dwendtag $C$DW$T$38
    1432
    1433
    1434$C$DW$T$40      .dwtag  DW_TAG_union_type
    1435        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1436$C$DW$103       .dwtag  DW_TAG_member
    1437        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$36)
    1438        .dwattr $C$DW$103, DW_AT_name("SYSCFG")
    1439        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SYSCFG")
    1440        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1442        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1443        .dwattr $C$DW$103, DW_AT_decl_line(0x34)
    1444        .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1445
    1446$C$DW$104       .dwtag  DW_TAG_member
    1447        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$39)
    1448        .dwattr $C$DW$104, DW_AT_name("SYSCFG_bit")
    1449        .dwattr $C$DW$104, DW_AT_TI_symbol_name("SYSCFG_bit")
    1450        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1452        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1453        .dwattr $C$DW$104, DW_AT_decl_line(0x3c)
    1454        .dwattr $C$DW$104, DW_AT_decl_column(0x05)
    1455
    1456        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1457        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1458        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1459        .dwendtag $C$DW$T$40
    1460
    1461
    1462$C$DW$T$42      .dwtag  DW_TAG_union_type
    1463        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1464$C$DW$105       .dwtag  DW_TAG_member
    1465        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$36)
    1466        .dwattr $C$DW$105, DW_AT_name("GPCFG0")
    1467        .dwattr $C$DW$105, DW_AT_TI_symbol_name("GPCFG0")
    1468        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1470        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1471        .dwattr $C$DW$105, DW_AT_decl_line(0x42)
    1472        .dwattr $C$DW$105, DW_AT_decl_column(0x15)
    1473
    1474$C$DW$106       .dwtag  DW_TAG_member
    1475        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$41)
    1476        .dwattr $C$DW$106, DW_AT_name("GPCFG0_bit")
    1477        .dwattr $C$DW$106, DW_AT_TI_symbol_name("GPCFG0_bit")
    1478        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1480        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1481        .dwattr $C$DW$106, DW_AT_decl_line(0x4f)
    1482        .dwattr $C$DW$106, DW_AT_decl_column(0x05)
    1483
    1484        .dwattr $C$DW$T$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1485        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   28

    1486        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
    1487        .dwendtag $C$DW$T$42
    1488
    1489
    1490$C$DW$T$44      .dwtag  DW_TAG_union_type
    1491        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1492$C$DW$107       .dwtag  DW_TAG_member
    1493        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$36)
    1494        .dwattr $C$DW$107, DW_AT_name("GPCFG1")
    1495        .dwattr $C$DW$107, DW_AT_TI_symbol_name("GPCFG1")
    1496        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1498        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1499        .dwattr $C$DW$107, DW_AT_decl_line(0x55)
    1500        .dwattr $C$DW$107, DW_AT_decl_column(0x15)
    1501
    1502$C$DW$108       .dwtag  DW_TAG_member
    1503        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$43)
    1504        .dwattr $C$DW$108, DW_AT_name("GPCFG1_bit")
    1505        .dwattr $C$DW$108, DW_AT_TI_symbol_name("GPCFG1_bit")
    1506        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1508        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1509        .dwattr $C$DW$108, DW_AT_decl_line(0x62)
    1510        .dwattr $C$DW$108, DW_AT_decl_column(0x05)
    1511
    1512        .dwattr $C$DW$T$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1513        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1514        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1515        .dwendtag $C$DW$T$44
    1516
    1517
    1518$C$DW$T$46      .dwtag  DW_TAG_union_type
    1519        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1520$C$DW$109       .dwtag  DW_TAG_member
    1521        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$36)
    1522        .dwattr $C$DW$109, DW_AT_name("CGR")
    1523        .dwattr $C$DW$109, DW_AT_TI_symbol_name("CGR")
    1524        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1526        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1527        .dwattr $C$DW$109, DW_AT_decl_line(0x68)
    1528        .dwattr $C$DW$109, DW_AT_decl_column(0x15)
    1529
    1530$C$DW$110       .dwtag  DW_TAG_member
    1531        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$45)
    1532        .dwattr $C$DW$110, DW_AT_name("CGR_bit")
    1533        .dwattr $C$DW$110, DW_AT_TI_symbol_name("CGR_bit")
    1534        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1536        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1537        .dwattr $C$DW$110, DW_AT_decl_line(0x7e)
    1538        .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    1539
    1540        .dwattr $C$DW$T$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   29

    1541        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1542        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1543        .dwendtag $C$DW$T$46
    1544
    1545
    1546$C$DW$T$48      .dwtag  DW_TAG_union_type
    1547        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1548$C$DW$111       .dwtag  DW_TAG_member
    1549        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$36)
    1550        .dwattr $C$DW$111, DW_AT_name("ISRP")
    1551        .dwattr $C$DW$111, DW_AT_TI_symbol_name("ISRP")
    1552        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1553        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1554        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1555        .dwattr $C$DW$111, DW_AT_decl_line(0x84)
    1556        .dwattr $C$DW$111, DW_AT_decl_column(0x15)
    1557
    1558$C$DW$112       .dwtag  DW_TAG_member
    1559        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$47)
    1560        .dwattr $C$DW$112, DW_AT_name("ISRP_bit")
    1561        .dwattr $C$DW$112, DW_AT_TI_symbol_name("ISRP_bit")
    1562        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1564        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1565        .dwattr $C$DW$112, DW_AT_decl_line(0x8d)
    1566        .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    1567
    1568        .dwattr $C$DW$T$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1569        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1570        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
    1571        .dwendtag $C$DW$T$48
    1572
    1573
    1574$C$DW$T$50      .dwtag  DW_TAG_union_type
    1575        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1576$C$DW$113       .dwtag  DW_TAG_member
    1577        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
    1578        .dwattr $C$DW$113, DW_AT_name("ISP")
    1579        .dwattr $C$DW$113, DW_AT_TI_symbol_name("ISP")
    1580        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1582        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1583        .dwattr $C$DW$113, DW_AT_decl_line(0x93)
    1584        .dwattr $C$DW$113, DW_AT_decl_column(0x15)
    1585
    1586$C$DW$114       .dwtag  DW_TAG_member
    1587        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$49)
    1588        .dwattr $C$DW$114, DW_AT_name("ISP_bit")
    1589        .dwattr $C$DW$114, DW_AT_TI_symbol_name("ISP_bit")
    1590        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1592        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1593        .dwattr $C$DW$114, DW_AT_decl_line(0x9c)
    1594        .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    1595
PRU Assembler Unix v2.3.3 Sun Apr 27 21:36:03 2025

Tools Copyright (c) 2012-2018 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   30

    1596        .dwattr $C$DW$T$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am3
    1597        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1598        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1599        .dwendtag $C$DW$T$50
    1600
    1601
    1602$C$DW$T$52      .dwtag  DW_TAG_union_type
    1603        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1604$C$DW$115       .dwtag  DW_TAG_member
    1605        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$36)
    1606        .dwattr $C$DW$115, DW_AT_name("IESP")
    1607        .dwattr $C$DW$115, DW_AT_TI_symbol_name("IESP")
    1608        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1609        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1610        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package-v6.0/include/am33
    1611        .dwattr $C$DW$115, DW_AT_decl_line(0xa1)
    1612        .dwattr $C$DW$115, DW_AT_decl_column(0x15)
    1613
    1614$C$DW$116       .dwtag  DW_TAG_member
    1615        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$51)
    1616        .dwattr $C$DW$116, DW_AT_name("IESP_bit")
    1617        .dwattr $C$DW$116, DW_AT_TI_symbol_name("IESP_bit")
    1618        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1619        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
